Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xe3c (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xd): GNU GIMPLE 10.3.1 20210824 (release) -mfloat-abi=soft -mthumb -mcpu=cortex-m3 -mfloat-abi=soft -march=armv7-m -g -g3 -fno-openmp -fno-openacc -fno-pie -fcf-protection=none -ffunction-sections -fdata-sections -fltrans
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x0): <artificial>
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x3aa0b): D:\work\gdk3\sdk\src\gem3
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
 <1><25>: Abbrev Number: 2 (DW_TAG_subprogram)
    <26>   DW_AT_abstract_origin: <0x10de>
    <2a>   DW_AT_low_pc      : 0x8000130
    <2e>   DW_AT_high_pc     : 0x58
    <32>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <34>   DW_AT_GNU_all_tail_call_sites: 1
    <34>   DW_AT_sibling     : <0x41>
 <2><38>: Abbrev Number: 3 (DW_TAG_variable)
    <39>   DW_AT_abstract_origin: <0x10e6>
    <3d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><40>: Abbrev Number: 0
 <1><41>: Abbrev Number: 4 (DW_TAG_subprogram)
    <42>   DW_AT_abstract_origin: <0x10c5>
    <46>   DW_AT_low_pc      : 0x8000188
    <4a>   DW_AT_high_pc     : 0x34

    <e23>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><e26>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <e27>   DW_AT_abstract_origin: <0x363b>
    <e2b>   DW_AT_location    : 2 byte block: 91 6a 	(DW_OP_fbreg: -22)
 <2><e2e>: Abbrev Number: 3 (DW_TAG_variable)
    <e2f>   DW_AT_abstract_origin: <0x3648>
    <e33>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><e36>: Abbrev Number: 3 (DW_TAG_variable)
    <e37>   DW_AT_abstract_origin: <0x3655>
    <e3b>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><e3e>: Abbrev Number: 0
 <1><e3f>: Abbrev Number: 0
  Compilation Unit @ offset 0xe40:
   Length:        0x2b0 (32-bit)
   Version:       4
   Abbrev Offset: 0x7a
   Pointer Size:  4
 <0><e4b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <e4c>   DW_AT_producer    : (indirect string, offset: 0x3b6c): GNU C17 10.3.1 20210824 (release) -mthumb -mcpu=cortex-m3 -mfloat-abi=soft -march=armv7-m -g3 -flto -ffunction-sections -fdata-sections
    <e50>   DW_AT_language    : 12	(ANSI C99)
    <e51>   DW_AT_name        : (indirect string, offset: 0x233b1): gem3.c
    <e55>   DW_AT_comp_dir    : (indirect string, offset: 0x3aa0b): D:\work\gdk3\sdk\src\gem3
    <e59>   DW_AT_stmt_list   : 0x147e
    <e5d>   DW_AT_GNU_macros  : 0x0
 <1><e61>: Abbrev Number: 2 (DW_TAG_base_type)
    <e62>   DW_AT_byte_size   : 1
    <e63>   DW_AT_encoding    : 6	(signed char)
    <e64>   DW_AT_name        : (indirect string, offset: 0x2ab3c): signed char
 <1><e68>: Abbrev Number: 2 (DW_TAG_base_type)
    <e69>   DW_AT_byte_size   : 1
    <e6a>   DW_AT_encoding    : 8	(unsigned char)
    <e6b>   DW_AT_name        : (indirect string, offset: 0x293d5): unsigned char
 <1><e6f>: Abbrev Number: 2 (DW_TAG_base_type)
    <e70>   DW_AT_byte_size   : 2
    <e71>   DW_AT_encoding    : 5	(signed)
    <e72>   DW_AT_name        : (indirect string, offset: 0x2229): short int
 <1><e76>: Abbrev Number: 3 (DW_TAG_typedef)
    <e77>   DW_AT_name        : (indirect string, offset: 0x2e280): __uint16_t
    <e7b>   DW_AT_decl_file   : 1
    <e7c>   DW_AT_decl_line   : 57
    <e7d>   DW_AT_decl_column : 25
    <e7e>   DW_AT_type        : <0xe82>
 <1><e82>: Abbrev Number: 2 (DW_TAG_base_type)
    <e83>   DW_AT_byte_size   : 2
    <e84>   DW_AT_encoding    : 7	(unsigned)
    <e85>   DW_AT_name        : (indirect string, offset: 0x1d20e): short unsigned int
 <1><e89>: Abbrev Number: 2 (DW_TAG_base_type)
    <e8a>   DW_AT_byte_size   : 4
    <e8b>   DW_AT_encoding    : 5	(signed)
    <e8c>   DW_AT_name        : (indirect string, offset: 0xb304): long int
 <1><e90>: Abbrev Number: 3 (DW_TAG_typedef)
    <e91>   DW_AT_name        : (indirect string, offset: 0x19438): __uint32_t
    <e95>   DW_AT_decl_file   : 1
    <e96>   DW_AT_decl_line   : 79
    <e97>   DW_AT_decl_column : 25
    <e98>   DW_AT_type        : <0xe9c>
 <1><e9c>: Abbrev Number: 2 (DW_TAG_base_type)
    <e9d>   DW_AT_byte_size   : 4
    <e9e>   DW_AT_encoding    : 7	(unsigned)
    <e9f>   DW_AT_name        : (indirect string, offset: 0x21fc8): long unsigned int
 <1><ea3>: Abbrev Number: 2 (DW_TAG_base_type)
    <ea4>   DW_AT_byte_size   : 8
    <ea5>   DW_AT_encoding    : 5	(signed)
    <ea6>   DW_AT_name        : (indirect string, offset: 0x16e38): long long int
 <1><eaa>: Abbrev Number: 2 (DW_TAG_base_type)
    <eab>   DW_AT_byte_size   : 8
    <eac>   DW_AT_encoding    : 7	(unsigned)
    <ead>   DW_AT_name        : (indirect string, offset: 0x13329): long long unsigned int
 <1><eb1>: Abbrev Number: 4 (DW_TAG_base_type)
    <eb2>   DW_AT_byte_size   : 4
    <eb3>   DW_AT_encoding    : 5	(signed)
    <eb4>   DW_AT_name        : int
 <1><eb8>: Abbrev Number: 2 (DW_TAG_base_type)
    <eb9>   DW_AT_byte_size   : 4
    <eba>   DW_AT_encoding    : 7	(unsigned)
    <ebb>   DW_AT_name        : (indirect string, offset: 0x32f20): unsigned int
 <1><ebf>: Abbrev Number: 3 (DW_TAG_typedef)
    <ec0>   DW_AT_name        : (indirect string, offset: 0x2e282): uint16_t
    <ec4>   DW_AT_decl_file   : 2
    <ec5>   DW_AT_decl_line   : 36
    <ec6>   DW_AT_decl_column : 20
    <ec7>   DW_AT_type        : <0xe76>
 <1><ecb>: Abbrev Number: 3 (DW_TAG_typedef)
    <ecc>   DW_AT_name        : (indirect string, offset: 0x1943a): uint32_t
    <ed0>   DW_AT_decl_file   : 2
    <ed1>   DW_AT_decl_line   : 48
    <ed2>   DW_AT_decl_column : 20
    <ed3>   DW_AT_type        : <0xe90>
 <1><ed7>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <ed8>   DW_AT_type        : <0xecb>
 <1><edc>: Abbrev Number: 6 (DW_TAG_variable)
    <edd>   DW_AT_name        : (indirect string, offset: 0x26683): SystemCoreClock
    <ee1>   DW_AT_decl_file   : 6
    <ee2>   DW_AT_decl_line   : 16
    <ee3>   DW_AT_decl_column : 17
    <ee4>   DW_AT_type        : <0xecb>
    <ee8>   DW_AT_external    : 1
    <ee8>   DW_AT_declaration : 1
 <1><ee8>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <ee9>   DW_AT_encoding    : 7	(unsigned)
    <eea>   DW_AT_byte_size   : 1
    <eeb>   DW_AT_type        : <0xe68>
    <eef>   DW_AT_decl_file   : 3
    <ef0>   DW_AT_decl_line   : 128
    <ef1>   DW_AT_decl_column : 14
    <ef2>   DW_AT_sibling     : <0xf03>
 <2><ef6>: Abbrev Number: 8 (DW_TAG_enumerator)
    <ef7>   DW_AT_name        : (indirect string, offset: 0x2f550): DISABLE
    <efb>   DW_AT_const_value : 0
 <2><efc>: Abbrev Number: 8 (DW_TAG_enumerator)
    <efd>   DW_AT_name        : (indirect string, offset: 0x9bb4): ENABLE
    <f01>   DW_AT_const_value : 1
 <2><f02>: Abbrev Number: 0
 <1><f03>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f04>   DW_AT_byte_size   : 28
    <f05>   DW_AT_decl_file   : 3
    <f06>   DW_AT_decl_line   : 401
    <f08>   DW_AT_decl_column : 9
    <f09>   DW_AT_sibling     : <0xf70>
 <2><f0d>: Abbrev Number: 10 (DW_TAG_member)
    <f0e>   DW_AT_name        : (indirect string, offset: 0x30322): CFGLR
    <f12>   DW_AT_decl_file   : 3
    <f13>   DW_AT_decl_line   : 403
    <f15>   DW_AT_decl_column : 17
    <f16>   DW_AT_type        : <0xed7>
    <f1a>   DW_AT_data_member_location: 0
 <2><f1b>: Abbrev Number: 10 (DW_TAG_member)
    <f1c>   DW_AT_name        : (indirect string, offset: 0x2f502): CFGHR
    <f20>   DW_AT_decl_file   : 3
    <f21>   DW_AT_decl_line   : 404
    <f23>   DW_AT_decl_column : 17
    <f24>   DW_AT_type        : <0xed7>
    <f28>   DW_AT_data_member_location: 4
 <2><f29>: Abbrev Number: 10 (DW_TAG_member)
    <f2a>   DW_AT_name        : (indirect string, offset: 0x2dd81): INDR
    <f2e>   DW_AT_decl_file   : 3
    <f2f>   DW_AT_decl_line   : 405
    <f31>   DW_AT_decl_column : 17
    <f32>   DW_AT_type        : <0xed7>
    <f36>   DW_AT_data_member_location: 8
 <2><f37>: Abbrev Number: 10 (DW_TAG_member)
    <f38>   DW_AT_name        : (indirect string, offset: 0x22de5): OUTDR
    <f3c>   DW_AT_decl_file   : 3
    <f3d>   DW_AT_decl_line   : 406
    <f3f>   DW_AT_decl_column : 17
    <f40>   DW_AT_type        : <0xed7>
    <f44>   DW_AT_data_member_location: 12
 <2><f45>: Abbrev Number: 10 (DW_TAG_member)
    <f46>   DW_AT_name        : (indirect string, offset: 0x26603): BSHR
    <f4a>   DW_AT_decl_file   : 3
    <f4b>   DW_AT_decl_line   : 407
    <f4d>   DW_AT_decl_column : 17
    <f4e>   DW_AT_type        : <0xed7>
    <f52>   DW_AT_data_member_location: 16
 <2><f53>: Abbrev Number: 11 (DW_TAG_member)
    <f54>   DW_AT_name        : BCR
    <f58>   DW_AT_decl_file   : 3
    <f59>   DW_AT_decl_line   : 408
    <f5b>   DW_AT_decl_column : 17
    <f5c>   DW_AT_type        : <0xed7>
    <f60>   DW_AT_data_member_location: 20
 <2><f61>: Abbrev Number: 10 (DW_TAG_member)
    <f62>   DW_AT_name        : (indirect string, offset: 0x33915): LCKR
    <f66>   DW_AT_decl_file   : 3
    <f67>   DW_AT_decl_line   : 409
    <f69>   DW_AT_decl_column : 17
    <f6a>   DW_AT_type        : <0xed7>
    <f6e>   DW_AT_data_member_location: 24
 <2><f6f>: Abbrev Number: 0
 <1><f70>: Abbrev Number: 12 (DW_TAG_typedef)
    <f71>   DW_AT_name        : (indirect string, offset: 0x2f455): GPIO_TypeDef
    <f75>   DW_AT_decl_file   : 3
    <f76>   DW_AT_decl_line   : 410
    <f78>   DW_AT_decl_column : 3
    <f79>   DW_AT_type        : <0xf03>
 <1><f7d>: Abbrev Number: 2 (DW_TAG_base_type)
    <f7e>   DW_AT_byte_size   : 8
    <f7f>   DW_AT_encoding    : 4	(float)
    <f80>   DW_AT_name        : (indirect string, offset: 0x113b5): long double
 <1><f84>: Abbrev Number: 2 (DW_TAG_base_type)
    <f85>   DW_AT_byte_size   : 1
    <f86>   DW_AT_encoding    : 8	(unsigned char)
    <f87>   DW_AT_name        : (indirect string, offset: 0x2ab43): char
 <1><f8b>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <f8c>   DW_AT_encoding    : 7	(unsigned)
    <f8d>   DW_AT_byte_size   : 1
    <f8e>   DW_AT_type        : <0xe68>
    <f92>   DW_AT_decl_file   : 4
    <f93>   DW_AT_decl_line   : 21
    <f94>   DW_AT_decl_column : 1
    <f95>   DW_AT_sibling     : <0xfac>
 <2><f99>: Abbrev Number: 8 (DW_TAG_enumerator)
    <f9a>   DW_AT_name        : (indirect string, offset: 0x26103): GPIO_Speed_10MHz
    <f9e>   DW_AT_const_value : 1
 <2><f9f>: Abbrev Number: 8 (DW_TAG_enumerator)
    <fa0>   DW_AT_name        : (indirect string, offset: 0x1e585): GPIO_Speed_2MHz
    <fa4>   DW_AT_const_value : 2
 <2><fa5>: Abbrev Number: 8 (DW_TAG_enumerator)
    <fa6>   DW_AT_name        : (indirect string, offset: 0xf9b5): GPIO_Speed_50MHz
    <faa>   DW_AT_const_value : 3
 <2><fab>: Abbrev Number: 0
 <1><fac>: Abbrev Number: 3 (DW_TAG_typedef)
    <fad>   DW_AT_name        : (indirect string, offset: 0x32d05): GPIOSpeed_TypeDef
    <fb1>   DW_AT_decl_file   : 4
    <fb2>   DW_AT_decl_line   : 25
    <fb3>   DW_AT_decl_column : 2
    <fb4>   DW_AT_type        : <0xf8b>
 <1><fb8>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <fb9>   DW_AT_encoding    : 7	(unsigned)
    <fba>   DW_AT_byte_size   : 1
    <fbb>   DW_AT_type        : <0xe68>
    <fbf>   DW_AT_decl_file   : 4
    <fc0>   DW_AT_decl_line   : 29
    <fc1>   DW_AT_decl_column : 1
    <fc2>   DW_AT_sibling     : <0xff7>
 <2><fc6>: Abbrev Number: 8 (DW_TAG_enumerator)
    <fc7>   DW_AT_name        : (indirect string, offset: 0x344e3): GPIO_Mode_AIN
    <fcb>   DW_AT_const_value : 0
 <2><fcc>: Abbrev Number: 8 (DW_TAG_enumerator)
    <fcd>   DW_AT_name        : (indirect string, offset: 0x1775c): GPIO_Mode_IN_FLOATING
    <fd1>   DW_AT_const_value : 4
 <2><fd2>: Abbrev Number: 8 (DW_TAG_enumerator)
    <fd3>   DW_AT_name        : (indirect string, offset: 0x8216): GPIO_Mode_IPD
    <fd7>   DW_AT_const_value : 40
 <2><fd8>: Abbrev Number: 8 (DW_TAG_enumerator)
    <fd9>   DW_AT_name        : (indirect string, offset: 0x827b): GPIO_Mode_IPU
    <fdd>   DW_AT_const_value : 72
 <2><fde>: Abbrev Number: 8 (DW_TAG_enumerator)
    <fdf>   DW_AT_name        : (indirect string, offset: 0x6a8d): GPIO_Mode_Out_OD
    <fe3>   DW_AT_const_value : 20
 <2><fe4>: Abbrev Number: 8 (DW_TAG_enumerator)
    <fe5>   DW_AT_name        : (indirect string, offset: 0x31db7): GPIO_Mode_Out_PP
    <fe9>   DW_AT_const_value : 16
 <2><fea>: Abbrev Number: 8 (DW_TAG_enumerator)
    <feb>   DW_AT_name        : (indirect string, offset: 0xecd7): GPIO_Mode_AF_OD
    <fef>   DW_AT_const_value : 28
 <2><ff0>: Abbrev Number: 8 (DW_TAG_enumerator)
    <ff1>   DW_AT_name        : (indirect string, offset: 0xf195): GPIO_Mode_AF_PP
    <ff5>   DW_AT_const_value : 24
 <2><ff6>: Abbrev Number: 0
 <1><ff7>: Abbrev Number: 3 (DW_TAG_typedef)
    <ff8>   DW_AT_name        : (indirect string, offset: 0x1fc93): GPIOMode_TypeDef
    <ffc>   DW_AT_decl_file   : 4
    <ffd>   DW_AT_decl_line   : 37
    <ffe>   DW_AT_decl_column : 2
    <fff>   DW_AT_type        : <0xfb8>
 <1><1003>: Abbrev Number: 13 (DW_TAG_structure_type)
    <1004>   DW_AT_byte_size   : 4
    <1005>   DW_AT_decl_file   : 4
    <1006>   DW_AT_decl_line   : 40
    <1007>   DW_AT_decl_column : 9
    <1008>   DW_AT_sibling     : <0x1034>
 <2><100c>: Abbrev Number: 14 (DW_TAG_member)
    <100d>   DW_AT_name        : (indirect string, offset: 0x1069a): GPIO_Pin
    <1011>   DW_AT_decl_file   : 4
    <1012>   DW_AT_decl_line   : 42
    <1013>   DW_AT_decl_column : 12
    <1014>   DW_AT_type        : <0xebf>
    <1018>   DW_AT_data_member_location: 0
 <2><1019>: Abbrev Number: 14 (DW_TAG_member)
    <101a>   DW_AT_name        : (indirect string, offset: 0x8eb3): GPIO_Speed
    <101e>   DW_AT_decl_file   : 4
    <101f>   DW_AT_decl_line   : 45
    <1020>   DW_AT_decl_column : 21
    <1021>   DW_AT_type        : <0xfac>
    <1025>   DW_AT_data_member_location: 2
 <2><1026>: Abbrev Number: 14 (DW_TAG_member)
    <1027>   DW_AT_name        : (indirect string, offset: 0x370a0): GPIO_Mode
    <102b>   DW_AT_decl_file   : 4
    <102c>   DW_AT_decl_line   : 48
    <102d>   DW_AT_decl_column : 20
    <102e>   DW_AT_type        : <0xff7>
    <1032>   DW_AT_data_member_location: 3
 <2><1033>: Abbrev Number: 0
 <1><1034>: Abbrev Number: 3 (DW_TAG_typedef)
    <1035>   DW_AT_name        : (indirect string, offset: 0x35ff6): GPIO_InitTypeDef
    <1039>   DW_AT_decl_file   : 4
    <103a>   DW_AT_decl_line   : 50
    <103b>   DW_AT_decl_column : 2
    <103c>   DW_AT_type        : <0x1003>
 <1><1040>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <1041>   DW_AT_encoding    : 7	(unsigned)
    <1042>   DW_AT_byte_size   : 1
    <1043>   DW_AT_type        : <0xe68>
    <1047>   DW_AT_decl_file   : 4
    <1048>   DW_AT_decl_line   : 155
    <1049>   DW_AT_decl_column : 1
    <104a>   DW_AT_sibling     : <0x105b>
 <2><104e>: Abbrev Number: 8 (DW_TAG_enumerator)
    <104f>   DW_AT_name        : (indirect string, offset: 0x2ad5d): GPIO_PIN_RESET
    <1053>   DW_AT_const_value : 0
 <2><1054>: Abbrev Number: 8 (DW_TAG_enumerator)
    <1055>   DW_AT_name        : (indirect string, offset: 0xffd9): GPIO_PIN_SET
    <1059>   DW_AT_const_value : 1
 <2><105a>: Abbrev Number: 0
 <1><105b>: Abbrev Number: 15 (DW_TAG_subprogram)
    <105c>   DW_AT_external    : 1
    <105c>   DW_AT_name        : (indirect string, offset: 0x88e2): main
    <1060>   DW_AT_decl_file   : 5
    <1061>   DW_AT_decl_line   : 75
    <1062>   DW_AT_decl_column : 5
    <1063>   DW_AT_prototyped  : 1
    <1063>   DW_AT_type        : <0xeb1>
    <1067>   DW_AT_sibling     : <0x1090>
 <2><106b>: Abbrev Number: 16 (DW_TAG_variable)
    <106c>   DW_AT_name        : (indirect string, offset: 0xf82d): blinking
    <1070>   DW_AT_decl_file   : 5
    <1071>   DW_AT_decl_line   : 77
    <1072>   DW_AT_decl_column : 9
    <1073>   DW_AT_type        : <0xeb1>
 <2><1077>: Abbrev Number: 16 (DW_TAG_variable)
    <1078>   DW_AT_name        : (indirect string, offset: 0x3326c): printing
    <107c>   DW_AT_decl_file   : 5
    <107d>   DW_AT_decl_line   : 77
    <107e>   DW_AT_decl_column : 23
    <107f>   DW_AT_type        : <0xeb1>
 <2><1083>: Abbrev Number: 16 (DW_TAG_variable)
    <1084>   DW_AT_name        : (indirect string, offset: 0x1bf8b): baudrate
    <1088>   DW_AT_decl_file   : 5
    <1089>   DW_AT_decl_line   : 78
    <108a>   DW_AT_decl_column : 9
    <108b>   DW_AT_type        : <0xeb1>
 <2><108f>: Abbrev Number: 0
 <1><1090>: Abbrev Number: 15 (DW_TAG_subprogram)
    <1091>   DW_AT_external    : 1
    <1091>   DW_AT_name        : (indirect string, offset: 0x950e): gd_blink
    <1095>   DW_AT_decl_file   : 5
    <1096>   DW_AT_decl_line   : 54
    <1097>   DW_AT_decl_column : 6
    <1098>   DW_AT_prototyped  : 1
    <1098>   DW_AT_type        : <0xeb1>
    <109c>   DW_AT_sibling     : <0x10c5>
 <2><10a0>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <10a1>   DW_AT_name        : (indirect string, offset: 0xf82d): blinking
    <10a5>   DW_AT_decl_file   : 5
    <10a6>   DW_AT_decl_line   : 54
    <10a7>   DW_AT_decl_column : 19
    <10a8>   DW_AT_type        : <0xeb1>
 <2><10ac>: Abbrev Number: 16 (DW_TAG_variable)
    <10ad>   DW_AT_name        : (indirect string, offset: 0xf43b): delay
    <10b1>   DW_AT_decl_file   : 5
    <10b2>   DW_AT_decl_line   : 56
    <10b3>   DW_AT_decl_column : 9
    <10b4>   DW_AT_type        : <0xeb1>
 <2><10b8>: Abbrev Number: 16 (DW_TAG_variable)
    <10b9>   DW_AT_name        : (indirect string, offset: 0x2ad22): counter
    <10bd>   DW_AT_decl_file   : 5
    <10be>   DW_AT_decl_line   : 57
    <10bf>   DW_AT_decl_column : 9
    <10c0>   DW_AT_type        : <0xeb1>
 <2><10c4>: Abbrev Number: 0
 <1><10c5>: Abbrev Number: 18 (DW_TAG_subprogram)
    <10c6>   DW_AT_external    : 1
    <10c6>   DW_AT_name        : (indirect string, offset: 0x27b55): LED_CONNECTED_OUT
    <10ca>   DW_AT_decl_file   : 5
    <10cb>   DW_AT_decl_line   : 46
    <10cc>   DW_AT_decl_column : 6
    <10cd>   DW_AT_prototyped  : 1
    <10cd>   DW_AT_sibling     : <0x10de>
 <2><10d1>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <10d2>   DW_AT_name        : bit
    <10d6>   DW_AT_decl_file   : 5
    <10d7>   DW_AT_decl_line   : 46
    <10d8>   DW_AT_decl_column : 33
    <10d9>   DW_AT_type        : <0xecb>
 <2><10dd>: Abbrev Number: 0
 <1><10de>: Abbrev Number: 20 (DW_TAG_subprogram)
    <10df>   DW_AT_external    : 1
    <10df>   DW_AT_name        : (indirect string, offset: 0x207e7): GPIO_Toggle_INIT
    <10e3>   DW_AT_decl_file   : 5
    <10e4>   DW_AT_decl_line   : 21
    <10e5>   DW_AT_decl_column : 6
    <10e6>   DW_AT_prototyped  : 1
 <2><10e6>: Abbrev Number: 16 (DW_TAG_variable)
    <10e7>   DW_AT_name        : (indirect string, offset: 0x30737): GPIO_InitStructure
    <10eb>   DW_AT_decl_file   : 5
    <10ec>   DW_AT_decl_line   : 23
    <10ed>   DW_AT_decl_column : 23
    <10ee>   DW_AT_type        : <0x1034>
 <2><10f2>: Abbrev Number: 0
 <1><10f3>: Abbrev Number: 0
  Compilation Unit @ offset 0x10f4:
   Length:        0xbdb (32-bit)
   Version:       4
   Abbrev Offset: 0x1ae
   Pointer Size:  4
 <0><10ff>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <1100>   DW_AT_producer    : (indirect string, offset: 0x3b6c): GNU C17 10.3.1 20210824 (release) -mthumb -mcpu=cortex-m3 -mfloat-abi=soft -march=armv7-m -g3 -flto -ffunction-sections -fdata-sections
    <1104>   DW_AT_language    : 12	(ANSI C99)
    <1105>   DW_AT_name        : (indirect string, offset: 0x38eb2): ../../debug/debug.c
    <1109>   DW_AT_comp_dir    : (indirect string, offset: 0x3aa0b): D:\work\gdk3\sdk\src\gem3
    <110d>   DW_AT_stmt_list   : 0x1927
    <1111>   DW_AT_GNU_macros  : 0xaba1
 <1><1115>: Abbrev Number: 2 (DW_TAG_base_type)
    <1116>   DW_AT_byte_size   : 1
    <1117>   DW_AT_encoding    : 6	(signed char)
    <1118>   DW_AT_name        : (indirect string, offset: 0x2ab3c): signed char
 <1><111c>: Abbrev Number: 3 (DW_TAG_typedef)
    <111d>   DW_AT_name        : (indirect string, offset: 0x38aba): __uint8_t
    <1121>   DW_AT_decl_file   : 1
    <1122>   DW_AT_decl_line   : 43
    <1123>   DW_AT_decl_column : 24
    <1124>   DW_AT_type        : <0x1128>
 <1><1128>: Abbrev Number: 2 (DW_TAG_base_type)
    <1129>   DW_AT_byte_size   : 1
    <112a>   DW_AT_encoding    : 8	(unsigned char)
    <112b>   DW_AT_name        : (indirect string, offset: 0x293d5): unsigned char
 <1><112f>: Abbrev Number: 2 (DW_TAG_base_type)
    <1130>   DW_AT_byte_size   : 2
    <1131>   DW_AT_encoding    : 5	(signed)
    <1132>   DW_AT_name        : (indirect string, offset: 0x2229): short int
 <1><1136>: Abbrev Number: 3 (DW_TAG_typedef)
    <1137>   DW_AT_name        : (indirect string, offset: 0x2e280): __uint16_t
    <113b>   DW_AT_decl_file   : 1
    <113c>   DW_AT_decl_line   : 57
    <113d>   DW_AT_decl_column : 25
    <113e>   DW_AT_type        : <0x1142>
 <1><1142>: Abbrev Number: 2 (DW_TAG_base_type)
    <1143>   DW_AT_byte_size   : 2
    <1144>   DW_AT_encoding    : 7	(unsigned)
    <1145>   DW_AT_name        : (indirect string, offset: 0x1d20e): short unsigned int
 <1><1149>: Abbrev Number: 2 (DW_TAG_base_type)
    <114a>   DW_AT_byte_size   : 4
    <114b>   DW_AT_encoding    : 5	(signed)
    <114c>   DW_AT_name        : (indirect string, offset: 0xb304): long int
 <1><1150>: Abbrev Number: 3 (DW_TAG_typedef)
    <1151>   DW_AT_name        : (indirect string, offset: 0x19438): __uint32_t
    <1155>   DW_AT_decl_file   : 1
    <1156>   DW_AT_decl_line   : 79
    <1157>   DW_AT_decl_column : 25
    <1158>   DW_AT_type        : <0x115c>
 <1><115c>: Abbrev Number: 2 (DW_TAG_base_type)
    <115d>   DW_AT_byte_size   : 4
    <115e>   DW_AT_encoding    : 7	(unsigned)
    <115f>   DW_AT_name        : (indirect string, offset: 0x21fc8): long unsigned int
 <1><1163>: Abbrev Number: 2 (DW_TAG_base_type)
    <1164>   DW_AT_byte_size   : 8
    <1165>   DW_AT_encoding    : 5	(signed)
    <1166>   DW_AT_name        : (indirect string, offset: 0x16e38): long long int
 <1><116a>: Abbrev Number: 2 (DW_TAG_base_type)
    <116b>   DW_AT_byte_size   : 8
    <116c>   DW_AT_encoding    : 7	(unsigned)
    <116d>   DW_AT_name        : (indirect string, offset: 0x13329): long long unsigned int
 <1><1171>: Abbrev Number: 4 (DW_TAG_base_type)
    <1172>   DW_AT_byte_size   : 4
    <1173>   DW_AT_encoding    : 5	(signed)
    <1174>   DW_AT_name        : int
 <1><1178>: Abbrev Number: 2 (DW_TAG_base_type)
    <1179>   DW_AT_byte_size   : 4
    <117a>   DW_AT_encoding    : 7	(unsigned)
    <117b>   DW_AT_name        : (indirect string, offset: 0x32f20): unsigned int
 <1><117f>: Abbrev Number: 3 (DW_TAG_typedef)
    <1180>   DW_AT_name        : (indirect string, offset: 0x38abc): uint8_t
    <1184>   DW_AT_decl_file   : 2
    <1185>   DW_AT_decl_line   : 24
    <1186>   DW_AT_decl_column : 19
    <1187>   DW_AT_type        : <0x111c>
 <1><118b>: Abbrev Number: 3 (DW_TAG_typedef)
    <118c>   DW_AT_name        : (indirect string, offset: 0x2e282): uint16_t
    <1190>   DW_AT_decl_file   : 2
    <1191>   DW_AT_decl_line   : 36
    <1192>   DW_AT_decl_column : 20
    <1193>   DW_AT_type        : <0x1136>
 <1><1197>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <1198>   DW_AT_type        : <0x118b>
 <1><119c>: Abbrev Number: 3 (DW_TAG_typedef)
    <119d>   DW_AT_name        : (indirect string, offset: 0x1943a): uint32_t
    <11a1>   DW_AT_decl_file   : 2
    <11a2>   DW_AT_decl_line   : 48
    <11a3>   DW_AT_decl_column : 20
    <11a4>   DW_AT_type        : <0x1150>
 <1><11a8>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <11a9>   DW_AT_type        : <0x119c>
 <1><11ad>: Abbrev Number: 6 (DW_TAG_const_type)
    <11ae>   DW_AT_type        : <0x11a8>
 <1><11b2>: Abbrev Number: 7 (DW_TAG_structure_type)
    <11b3>   DW_AT_byte_size   : 16
    <11b4>   DW_AT_decl_file   : 3
    <11b5>   DW_AT_decl_line   : 365
    <11b7>   DW_AT_decl_column : 9
    <11b8>   DW_AT_sibling     : <0x11f5>
 <2><11bc>: Abbrev Number: 8 (DW_TAG_member)
    <11bd>   DW_AT_name        : (indirect string, offset: 0x38c1e): CTRL
    <11c1>   DW_AT_decl_file   : 3
    <11c2>   DW_AT_decl_line   : 367
    <11c4>   DW_AT_decl_column : 17
    <11c5>   DW_AT_type        : <0x11a8>
    <11c9>   DW_AT_data_member_location: 0
 <2><11ca>: Abbrev Number: 8 (DW_TAG_member)
    <11cb>   DW_AT_name        : (indirect string, offset: 0x38b36): LOAD
    <11cf>   DW_AT_decl_file   : 3
    <11d0>   DW_AT_decl_line   : 368
    <11d2>   DW_AT_decl_column : 17
    <11d3>   DW_AT_type        : <0x11a8>
    <11d7>   DW_AT_data_member_location: 4
 <2><11d8>: Abbrev Number: 9 (DW_TAG_member)
    <11d9>   DW_AT_name        : VAL
    <11dd>   DW_AT_decl_file   : 3
    <11de>   DW_AT_decl_line   : 369
    <11e0>   DW_AT_decl_column : 17
    <11e1>   DW_AT_type        : <0x11a8>
    <11e5>   DW_AT_data_member_location: 8
 <2><11e6>: Abbrev Number: 8 (DW_TAG_member)
    <11e7>   DW_AT_name        : (indirect string, offset: 0x38e37): CALIB
    <11eb>   DW_AT_decl_file   : 3
    <11ec>   DW_AT_decl_line   : 370
    <11ee>   DW_AT_decl_column : 17
    <11ef>   DW_AT_type        : <0x11ad>
    <11f3>   DW_AT_data_member_location: 12
 <2><11f4>: Abbrev Number: 0
 <1><11f5>: Abbrev Number: 10 (DW_TAG_typedef)
    <11f6>   DW_AT_name        : (indirect string, offset: 0x38d80): SysTick_Type
    <11fa>   DW_AT_decl_file   : 3
    <11fb>   DW_AT_decl_line   : 371
    <11fd>   DW_AT_decl_column : 3
    <11fe>   DW_AT_type        : <0x11b2>
 <1><1202>: Abbrev Number: 11 (DW_TAG_variable)
    <1203>   DW_AT_name        : (indirect string, offset: 0x26683): SystemCoreClock
    <1207>   DW_AT_decl_file   : 13
    <1208>   DW_AT_decl_line   : 16
    <1209>   DW_AT_decl_column : 17
    <120a>   DW_AT_type        : <0x119c>
    <120e>   DW_AT_external    : 1
    <120e>   DW_AT_declaration : 1
 <1><120e>: Abbrev Number: 12 (DW_TAG_typedef)
    <120f>   DW_AT_name        : u32
    <1213>   DW_AT_decl_file   : 4
    <1214>   DW_AT_decl_line   : 114
    <1215>   DW_AT_decl_column : 19
    <1216>   DW_AT_type        : <0x119c>
 <1><121a>: Abbrev Number: 12 (DW_TAG_typedef)
    <121b>   DW_AT_name        : u16
    <121f>   DW_AT_decl_file   : 4
    <1220>   DW_AT_decl_line   : 115
    <1221>   DW_AT_decl_column : 18
    <1222>   DW_AT_type        : <0x118b>
 <1><1226>: Abbrev Number: 12 (DW_TAG_typedef)
    <1227>   DW_AT_name        : u8
    <122a>   DW_AT_decl_file   : 4
    <122b>   DW_AT_decl_line   : 116
    <122c>   DW_AT_decl_column : 18
    <122d>   DW_AT_type        : <0x117f>
 <1><1231>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <1232>   DW_AT_encoding    : 7	(unsigned)
    <1233>   DW_AT_byte_size   : 1
    <1234>   DW_AT_type        : <0x1128>
    <1238>   DW_AT_decl_file   : 4
    <1239>   DW_AT_decl_line   : 128
    <123a>   DW_AT_decl_column : 14
    <123b>   DW_AT_sibling     : <0x124c>
 <2><123f>: Abbrev Number: 14 (DW_TAG_enumerator)
    <1240>   DW_AT_name        : (indirect string, offset: 0x2f550): DISABLE
    <1244>   DW_AT_const_value : 0
 <2><1245>: Abbrev Number: 14 (DW_TAG_enumerator)
    <1246>   DW_AT_name        : (indirect string, offset: 0x9bb4): ENABLE
    <124a>   DW_AT_const_value : 1
 <2><124b>: Abbrev Number: 0
 <1><124c>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <124d>   DW_AT_encoding    : 7	(unsigned)
    <124e>   DW_AT_byte_size   : 1
    <124f>   DW_AT_type        : <0x1128>
    <1253>   DW_AT_decl_file   : 4
    <1254>   DW_AT_decl_line   : 130
    <1255>   DW_AT_decl_column : 14
    <1256>   DW_AT_sibling     : <0x1267>
 <2><125a>: Abbrev Number: 14 (DW_TAG_enumerator)
    <125b>   DW_AT_name        : (indirect string, offset: 0x2ad66): RESET
    <125f>   DW_AT_const_value : 0
 <2><1260>: Abbrev Number: 15 (DW_TAG_enumerator)
    <1261>   DW_AT_name        : SET
    <1265>   DW_AT_const_value : 1
 <2><1266>: Abbrev Number: 0
 <1><1267>: Abbrev Number: 7 (DW_TAG_structure_type)
    <1268>   DW_AT_byte_size   : 28
    <1269>   DW_AT_decl_file   : 4
    <126a>   DW_AT_decl_line   : 401
    <126c>   DW_AT_decl_column : 9
    <126d>   DW_AT_sibling     : <0x12d4>
 <2><1271>: Abbrev Number: 8 (DW_TAG_member)
    <1272>   DW_AT_name        : (indirect string, offset: 0x30322): CFGLR
    <1276>   DW_AT_decl_file   : 4
    <1277>   DW_AT_decl_line   : 403
    <1279>   DW_AT_decl_column : 17
    <127a>   DW_AT_type        : <0x11a8>
    <127e>   DW_AT_data_member_location: 0
 <2><127f>: Abbrev Number: 8 (DW_TAG_member)
    <1280>   DW_AT_name        : (indirect string, offset: 0x2f502): CFGHR
    <1284>   DW_AT_decl_file   : 4
    <1285>   DW_AT_decl_line   : 404
    <1287>   DW_AT_decl_column : 17
    <1288>   DW_AT_type        : <0x11a8>
    <128c>   DW_AT_data_member_location: 4
 <2><128d>: Abbrev Number: 8 (DW_TAG_member)
    <128e>   DW_AT_name        : (indirect string, offset: 0x2dd81): INDR
    <1292>   DW_AT_decl_file   : 4
    <1293>   DW_AT_decl_line   : 405
    <1295>   DW_AT_decl_column : 17
    <1296>   DW_AT_type        : <0x11a8>
    <129a>   DW_AT_data_member_location: 8
 <2><129b>: Abbrev Number: 8 (DW_TAG_member)
    <129c>   DW_AT_name        : (indirect string, offset: 0x22de5): OUTDR
    <12a0>   DW_AT_decl_file   : 4
    <12a1>   DW_AT_decl_line   : 406
    <12a3>   DW_AT_decl_column : 17
    <12a4>   DW_AT_type        : <0x11a8>
    <12a8>   DW_AT_data_member_location: 12
 <2><12a9>: Abbrev Number: 8 (DW_TAG_member)
    <12aa>   DW_AT_name        : (indirect string, offset: 0x26603): BSHR
    <12ae>   DW_AT_decl_file   : 4
    <12af>   DW_AT_decl_line   : 407
    <12b1>   DW_AT_decl_column : 17
    <12b2>   DW_AT_type        : <0x11a8>
    <12b6>   DW_AT_data_member_location: 16
 <2><12b7>: Abbrev Number: 9 (DW_TAG_member)
    <12b8>   DW_AT_name        : BCR
    <12bc>   DW_AT_decl_file   : 4
    <12bd>   DW_AT_decl_line   : 408
    <12bf>   DW_AT_decl_column : 17
    <12c0>   DW_AT_type        : <0x11a8>
    <12c4>   DW_AT_data_member_location: 20
 <2><12c5>: Abbrev Number: 8 (DW_TAG_member)
    <12c6>   DW_AT_name        : (indirect string, offset: 0x33915): LCKR
    <12ca>   DW_AT_decl_file   : 4
    <12cb>   DW_AT_decl_line   : 409
    <12cd>   DW_AT_decl_column : 17
    <12ce>   DW_AT_type        : <0x11a8>
    <12d2>   DW_AT_data_member_location: 24
 <2><12d3>: Abbrev Number: 0
 <1><12d4>: Abbrev Number: 10 (DW_TAG_typedef)
    <12d5>   DW_AT_name        : (indirect string, offset: 0x2f455): GPIO_TypeDef
    <12d9>   DW_AT_decl_file   : 4
    <12da>   DW_AT_decl_line   : 410
    <12dc>   DW_AT_decl_column : 3
    <12dd>   DW_AT_type        : <0x1267>
 <1><12e1>: Abbrev Number: 7 (DW_TAG_structure_type)
    <12e2>   DW_AT_byte_size   : 28
    <12e3>   DW_AT_decl_file   : 4
    <12e4>   DW_AT_decl_line   : 581
    <12e6>   DW_AT_decl_column : 9
    <12e7>   DW_AT_sibling     : <0x13b0>
 <2><12eb>: Abbrev Number: 8 (DW_TAG_member)
    <12ec>   DW_AT_name        : (indirect string, offset: 0x38dc6): STATR
    <12f0>   DW_AT_decl_file   : 4
    <12f1>   DW_AT_decl_line   : 583
    <12f3>   DW_AT_decl_column : 17
    <12f4>   DW_AT_type        : <0x1197>
    <12f8>   DW_AT_data_member_location: 0
 <2><12f9>: Abbrev Number: 8 (DW_TAG_member)
    <12fa>   DW_AT_name        : (indirect string, offset: 0x38d1a): RESERVED0
    <12fe>   DW_AT_decl_file   : 4
    <12ff>   DW_AT_decl_line   : 584
    <1301>   DW_AT_decl_column : 13
    <1302>   DW_AT_type        : <0x118b>
    <1306>   DW_AT_data_member_location: 2
 <2><1307>: Abbrev Number: 8 (DW_TAG_member)
    <1308>   DW_AT_name        : (indirect string, offset: 0x38dc0): DATAR
    <130c>   DW_AT_decl_file   : 4
    <130d>   DW_AT_decl_line   : 585
    <130f>   DW_AT_decl_column : 17
    <1310>   DW_AT_type        : <0x1197>
    <1314>   DW_AT_data_member_location: 4
 <2><1315>: Abbrev Number: 8 (DW_TAG_member)
    <1316>   DW_AT_name        : (indirect string, offset: 0x38d24): RESERVED1
    <131a>   DW_AT_decl_file   : 4
    <131b>   DW_AT_decl_line   : 586
    <131d>   DW_AT_decl_column : 13
    <131e>   DW_AT_type        : <0x118b>
    <1322>   DW_AT_data_member_location: 6
 <2><1323>: Abbrev Number: 9 (DW_TAG_member)
    <1324>   DW_AT_name        : BRR
    <1328>   DW_AT_decl_file   : 4
    <1329>   DW_AT_decl_line   : 587
    <132b>   DW_AT_decl_column : 17
    <132c>   DW_AT_type        : <0x1197>
    <1330>   DW_AT_data_member_location: 8
 <2><1331>: Abbrev Number: 8 (DW_TAG_member)
    <1332>   DW_AT_name        : (indirect string, offset: 0x38d2e): RESERVED2
    <1336>   DW_AT_decl_file   : 4
    <1337>   DW_AT_decl_line   : 588
    <1339>   DW_AT_decl_column : 13
    <133a>   DW_AT_type        : <0x118b>
    <133e>   DW_AT_data_member_location: 10
 <2><133f>: Abbrev Number: 8 (DW_TAG_member)
    <1340>   DW_AT_name        : (indirect string, offset: 0x38bbe): CTLR1
    <1344>   DW_AT_decl_file   : 4
    <1345>   DW_AT_decl_line   : 589
    <1347>   DW_AT_decl_column : 17
    <1348>   DW_AT_type        : <0x1197>
    <134c>   DW_AT_data_member_location: 12
 <2><134d>: Abbrev Number: 8 (DW_TAG_member)
    <134e>   DW_AT_name        : (indirect string, offset: 0x38d38): RESERVED3
    <1352>   DW_AT_decl_file   : 4
    <1353>   DW_AT_decl_line   : 590
    <1355>   DW_AT_decl_column : 13
    <1356>   DW_AT_type        : <0x118b>
    <135a>   DW_AT_data_member_location: 14
 <2><135b>: Abbrev Number: 8 (DW_TAG_member)
    <135c>   DW_AT_name        : (indirect string, offset: 0x38bc4): CTLR2
    <1360>   DW_AT_decl_file   : 4
    <1361>   DW_AT_decl_line   : 591
    <1363>   DW_AT_decl_column : 17
    <1364>   DW_AT_type        : <0x1197>
    <1368>   DW_AT_data_member_location: 16
 <2><1369>: Abbrev Number: 8 (DW_TAG_member)
    <136a>   DW_AT_name        : (indirect string, offset: 0x38d42): RESERVED4
    <136e>   DW_AT_decl_file   : 4
    <136f>   DW_AT_decl_line   : 592
    <1371>   DW_AT_decl_column : 13
    <1372>   DW_AT_type        : <0x118b>
    <1376>   DW_AT_data_member_location: 18
 <2><1377>: Abbrev Number: 8 (DW_TAG_member)
    <1378>   DW_AT_name        : (indirect string, offset: 0x38bca): CTLR3
    <137c>   DW_AT_decl_file   : 4
    <137d>   DW_AT_decl_line   : 593
    <137f>   DW_AT_decl_column : 17
    <1380>   DW_AT_type        : <0x1197>
    <1384>   DW_AT_data_member_location: 20
 <2><1385>: Abbrev Number: 8 (DW_TAG_member)
    <1386>   DW_AT_name        : (indirect string, offset: 0x38d4c): RESERVED5
    <138a>   DW_AT_decl_file   : 4
    <138b>   DW_AT_decl_line   : 594
    <138d>   DW_AT_decl_column : 13
    <138e>   DW_AT_type        : <0x118b>
    <1392>   DW_AT_data_member_location: 22
 <2><1393>: Abbrev Number: 9 (DW_TAG_member)
    <1394>   DW_AT_name        : GPR
    <1398>   DW_AT_decl_file   : 4
    <1399>   DW_AT_decl_line   : 595
    <139b>   DW_AT_decl_column : 17
    <139c>   DW_AT_type        : <0x1197>
    <13a0>   DW_AT_data_member_location: 24
 <2><13a1>: Abbrev Number: 8 (DW_TAG_member)
    <13a2>   DW_AT_name        : (indirect string, offset: 0x38af8): RESERVED6
    <13a6>   DW_AT_decl_file   : 4
    <13a7>   DW_AT_decl_line   : 596
    <13a9>   DW_AT_decl_column : 13
    <13aa>   DW_AT_type        : <0x118b>
    <13ae>   DW_AT_data_member_location: 26
 <2><13af>: Abbrev Number: 0
 <1><13b0>: Abbrev Number: 10 (DW_TAG_typedef)
    <13b1>   DW_AT_name        : (indirect string, offset: 0x38ccb): USART_TypeDef
    <13b5>   DW_AT_decl_file   : 4
    <13b6>   DW_AT_decl_line   : 597
    <13b8>   DW_AT_decl_column : 3
    <13b9>   DW_AT_type        : <0x12e1>
 <1><13bd>: Abbrev Number: 2 (DW_TAG_base_type)
    <13be>   DW_AT_byte_size   : 8
    <13bf>   DW_AT_encoding    : 4	(float)
    <13c0>   DW_AT_name        : (indirect string, offset: 0x113b5): long double
 <1><13c4>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <13c5>   DW_AT_byte_size   : 4
 <1><13c6>: Abbrev Number: 10 (DW_TAG_typedef)
    <13c7>   DW_AT_name        : (indirect string, offset: 0x245a2): wint_t
    <13cb>   DW_AT_decl_file   : 5
    <13cc>   DW_AT_decl_line   : 350
    <13ce>   DW_AT_decl_column : 23
    <13cf>   DW_AT_type        : <0x1178>
 <1><13d3>: Abbrev Number: 3 (DW_TAG_typedef)
    <13d4>   DW_AT_name        : (indirect string, offset: 0x38b5d): _off_t
    <13d8>   DW_AT_decl_file   : 6
    <13d9>   DW_AT_decl_line   : 46
    <13da>   DW_AT_decl_column : 14
    <13db>   DW_AT_type        : <0x1149>
 <1><13df>: Abbrev Number: 3 (DW_TAG_typedef)
    <13e0>   DW_AT_name        : (indirect string, offset: 0x38d08): _fpos_t
    <13e4>   DW_AT_decl_file   : 6
    <13e5>   DW_AT_decl_line   : 116
    <13e6>   DW_AT_decl_column : 14
    <13e7>   DW_AT_type        : <0x1149>
 <1><13eb>: Abbrev Number: 17 (DW_TAG_union_type)
    <13ec>   DW_AT_byte_size   : 4
    <13ed>   DW_AT_decl_file   : 6
    <13ee>   DW_AT_decl_line   : 165
    <13ef>   DW_AT_decl_column : 3
    <13f0>   DW_AT_sibling     : <0x140d>
 <2><13f4>: Abbrev Number: 18 (DW_TAG_member)
    <13f5>   DW_AT_name        : (indirect string, offset: 0x38c33): __wch
    <13f9>   DW_AT_decl_file   : 6
    <13fa>   DW_AT_decl_line   : 167
    <13fb>   DW_AT_decl_column : 12
    <13fc>   DW_AT_type        : <0x13c6>
 <2><1400>: Abbrev Number: 18 (DW_TAG_member)
    <1401>   DW_AT_name        : (indirect string, offset: 0x38b02): __wchb
    <1405>   DW_AT_decl_file   : 6
    <1406>   DW_AT_decl_line   : 168
    <1407>   DW_AT_decl_column : 19
    <1408>   DW_AT_type        : <0x140d>
 <2><140c>: Abbrev Number: 0
 <1><140d>: Abbrev Number: 19 (DW_TAG_array_type)
    <140e>   DW_AT_type        : <0x1128>
    <1412>   DW_AT_sibling     : <0x141d>
 <2><1416>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <1417>   DW_AT_type        : <0x1178>
    <141b>   DW_AT_upper_bound : 3
 <2><141c>: Abbrev Number: 0
 <1><141d>: Abbrev Number: 21 (DW_TAG_structure_type)
    <141e>   DW_AT_byte_size   : 8
    <141f>   DW_AT_decl_file   : 6
    <1420>   DW_AT_decl_line   : 162
    <1421>   DW_AT_decl_column : 9
    <1422>   DW_AT_sibling     : <0x1441>
 <2><1426>: Abbrev Number: 22 (DW_TAG_member)
    <1427>   DW_AT_name        : (indirect string, offset: 0x38eef): __count
    <142b>   DW_AT_decl_file   : 6
    <142c>   DW_AT_decl_line   : 164
    <142d>   DW_AT_decl_column : 7
    <142e>   DW_AT_type        : <0x1171>
    <1432>   DW_AT_data_member_location: 0
 <2><1433>: Abbrev Number: 22 (DW_TAG_member)
    <1434>   DW_AT_name        : (indirect string, offset: 0x38c23): __value
    <1438>   DW_AT_decl_file   : 6
    <1439>   DW_AT_decl_line   : 169
    <143a>   DW_AT_decl_column : 5
    <143b>   DW_AT_type        : <0x13eb>
    <143f>   DW_AT_data_member_location: 4
 <2><1440>: Abbrev Number: 0
 <1><1441>: Abbrev Number: 3 (DW_TAG_typedef)
    <1442>   DW_AT_name        : (indirect string, offset: 0x38d67): _mbstate_t
    <1446>   DW_AT_decl_file   : 6
    <1447>   DW_AT_decl_line   : 170
    <1448>   DW_AT_decl_column : 3
    <1449>   DW_AT_type        : <0x141d>
 <1><144d>: Abbrev Number: 3 (DW_TAG_typedef)
    <144e>   DW_AT_name        : (indirect string, offset: 0x38c2b): __ULong
    <1452>   DW_AT_decl_file   : 7
    <1453>   DW_AT_decl_line   : 22
    <1454>   DW_AT_decl_column : 25
    <1455>   DW_AT_type        : <0x115c>
 <1><1459>: Abbrev Number: 3 (DW_TAG_typedef)
    <145a>   DW_AT_name        : (indirect string, offset: 0x89a3): _LOCK_T
    <145e>   DW_AT_decl_file   : 8
    <145f>   DW_AT_decl_line   : 34
    <1460>   DW_AT_decl_column : 25
    <1461>   DW_AT_type        : <0x1465>
 <1><1465>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <1466>   DW_AT_byte_size   : 4
    <1467>   DW_AT_type        : <0x146b>
 <1><146b>: Abbrev Number: 24 (DW_TAG_structure_type)
    <146c>   DW_AT_name        : (indirect string, offset: 0x38f29): __lock
    <1470>   DW_AT_declaration : 1
 <1><1470>: Abbrev Number: 3 (DW_TAG_typedef)
    <1471>   DW_AT_name        : (indirect string, offset: 0x38bd8): _flock_t
    <1475>   DW_AT_decl_file   : 7
    <1476>   DW_AT_decl_line   : 35
    <1477>   DW_AT_decl_column : 27
    <1478>   DW_AT_type        : <0x1459>
 <1><147c>: Abbrev Number: 25 (DW_TAG_structure_type)
    <147d>   DW_AT_name        : (indirect string, offset: 0x38be8): _Bigint
    <1481>   DW_AT_byte_size   : 24
    <1482>   DW_AT_decl_file   : 7
    <1483>   DW_AT_decl_line   : 52
    <1484>   DW_AT_decl_column : 8
    <1485>   DW_AT_sibling     : <0x14d6>
 <2><1489>: Abbrev Number: 22 (DW_TAG_member)
    <148a>   DW_AT_name        : (indirect string, offset: 0x38f23): _next
    <148e>   DW_AT_decl_file   : 7
    <148f>   DW_AT_decl_line   : 54
    <1490>   DW_AT_decl_column : 19
    <1491>   DW_AT_type        : <0x14d6>
    <1495>   DW_AT_data_member_location: 0
 <2><1496>: Abbrev Number: 26 (DW_TAG_member)
    <1497>   DW_AT_name        : _k
    <149a>   DW_AT_decl_file   : 7
    <149b>   DW_AT_decl_line   : 55
    <149c>   DW_AT_decl_column : 7
    <149d>   DW_AT_type        : <0x1171>
    <14a1>   DW_AT_data_member_location: 4
 <2><14a2>: Abbrev Number: 22 (DW_TAG_member)
    <14a3>   DW_AT_name        : (indirect string, offset: 0x38a8e): _maxwds
    <14a7>   DW_AT_decl_file   : 7
    <14a8>   DW_AT_decl_line   : 55
    <14a9>   DW_AT_decl_column : 11
    <14aa>   DW_AT_type        : <0x1171>
    <14ae>   DW_AT_data_member_location: 8
 <2><14af>: Abbrev Number: 22 (DW_TAG_member)
    <14b0>   DW_AT_name        : (indirect string, offset: 0x38e46): _sign
    <14b4>   DW_AT_decl_file   : 7
    <14b5>   DW_AT_decl_line   : 55
    <14b6>   DW_AT_decl_column : 20
    <14b7>   DW_AT_type        : <0x1171>
    <14bb>   DW_AT_data_member_location: 12
 <2><14bc>: Abbrev Number: 22 (DW_TAG_member)
    <14bd>   DW_AT_name        : (indirect string, offset: 0x38aed): _wds
    <14c1>   DW_AT_decl_file   : 7
    <14c2>   DW_AT_decl_line   : 55
    <14c3>   DW_AT_decl_column : 27
    <14c4>   DW_AT_type        : <0x1171>
    <14c8>   DW_AT_data_member_location: 16
 <2><14c9>: Abbrev Number: 26 (DW_TAG_member)
    <14ca>   DW_AT_name        : _x
    <14cd>   DW_AT_decl_file   : 7
    <14ce>   DW_AT_decl_line   : 56
    <14cf>   DW_AT_decl_column : 11
    <14d0>   DW_AT_type        : <0x14dc>
    <14d4>   DW_AT_data_member_location: 20
 <2><14d5>: Abbrev Number: 0
 <1><14d6>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <14d7>   DW_AT_byte_size   : 4
    <14d8>   DW_AT_type        : <0x147c>
 <1><14dc>: Abbrev Number: 19 (DW_TAG_array_type)
    <14dd>   DW_AT_type        : <0x144d>
    <14e1>   DW_AT_sibling     : <0x14ec>
 <2><14e5>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <14e6>   DW_AT_type        : <0x1178>
    <14ea>   DW_AT_upper_bound : 0
 <2><14eb>: Abbrev Number: 0
 <1><14ec>: Abbrev Number: 25 (DW_TAG_structure_type)
    <14ed>   DW_AT_name        : (indirect string, offset: 0x38cde): __tm
    <14f1>   DW_AT_byte_size   : 36
    <14f2>   DW_AT_decl_file   : 7
    <14f3>   DW_AT_decl_line   : 60
    <14f4>   DW_AT_decl_column : 8
    <14f5>   DW_AT_sibling     : <0x156f>
 <2><14f9>: Abbrev Number: 22 (DW_TAG_member)
    <14fa>   DW_AT_name        : (indirect string, offset: 0x38db0): __tm_sec
    <14fe>   DW_AT_decl_file   : 7
    <14ff>   DW_AT_decl_line   : 62
    <1500>   DW_AT_decl_column : 9
    <1501>   DW_AT_type        : <0x1171>
    <1505>   DW_AT_data_member_location: 0
 <2><1506>: Abbrev Number: 22 (DW_TAG_member)
    <1507>   DW_AT_name        : (indirect string, offset: 0x38c80): __tm_min
    <150b>   DW_AT_decl_file   : 7
    <150c>   DW_AT_decl_line   : 63
    <150d>   DW_AT_decl_column : 9
    <150e>   DW_AT_type        : <0x1171>
    <1512>   DW_AT_data_member_location: 4
 <2><1513>: Abbrev Number: 22 (DW_TAG_member)
    <1514>   DW_AT_name        : (indirect string, offset: 0x38e92): __tm_hour
    <1518>   DW_AT_decl_file   : 7
    <1519>   DW_AT_decl_line   : 64
    <151a>   DW_AT_decl_column : 9
    <151b>   DW_AT_type        : <0x1171>
    <151f>   DW_AT_data_member_location: 8
 <2><1520>: Abbrev Number: 22 (DW_TAG_member)
    <1521>   DW_AT_name        : (indirect string, offset: 0x38d10): __tm_mday
    <1525>   DW_AT_decl_file   : 7
    <1526>   DW_AT_decl_line   : 65
    <1527>   DW_AT_decl_column : 9
    <1528>   DW_AT_type        : <0x1171>
    <152c>   DW_AT_data_member_location: 12
 <2><152d>: Abbrev Number: 22 (DW_TAG_member)
    <152e>   DW_AT_name        : (indirect string, offset: 0x38cc2): __tm_mon
    <1532>   DW_AT_decl_file   : 7
    <1533>   DW_AT_decl_line   : 66
    <1534>   DW_AT_decl_column : 9
    <1535>   DW_AT_type        : <0x1171>
    <1539>   DW_AT_data_member_location: 16
 <2><153a>: Abbrev Number: 22 (DW_TAG_member)
    <153b>   DW_AT_name        : (indirect string, offset: 0x38b6c): __tm_year
    <153f>   DW_AT_decl_file   : 7
    <1540>   DW_AT_decl_line   : 67
    <1541>   DW_AT_decl_column : 9
    <1542>   DW_AT_type        : <0x1171>
    <1546>   DW_AT_data_member_location: 20
 <2><1547>: Abbrev Number: 22 (DW_TAG_member)
    <1548>   DW_AT_name        : (indirect string, offset: 0x38b9c): __tm_wday
    <154c>   DW_AT_decl_file   : 7
    <154d>   DW_AT_decl_line   : 68
    <154e>   DW_AT_decl_column : 9
    <154f>   DW_AT_type        : <0x1171>
    <1553>   DW_AT_data_member_location: 24
 <2><1554>: Abbrev Number: 22 (DW_TAG_member)
    <1555>   DW_AT_name        : (indirect string, offset: 0x38ed7): __tm_yday
    <1559>   DW_AT_decl_file   : 7
    <155a>   DW_AT_decl_line   : 69
    <155b>   DW_AT_decl_column : 9
    <155c>   DW_AT_type        : <0x1171>
    <1560>   DW_AT_data_member_location: 28
 <2><1561>: Abbrev Number: 22 (DW_TAG_member)
    <1562>   DW_AT_name        : (indirect string, offset: 0x38aaf): __tm_isdst
    <1566>   DW_AT_decl_file   : 7
    <1567>   DW_AT_decl_line   : 70
    <1568>   DW_AT_decl_column : 9
    <1569>   DW_AT_type        : <0x1171>
    <156d>   DW_AT_data_member_location: 32
 <2><156e>: Abbrev Number: 0
 <1><156f>: Abbrev Number: 25 (DW_TAG_structure_type)
    <1570>   DW_AT_name        : (indirect string, offset: 0x38c98): __sbuf
    <1574>   DW_AT_byte_size   : 8
    <1575>   DW_AT_decl_file   : 7
    <1576>   DW_AT_decl_line   : 122
    <1577>   DW_AT_decl_column : 8
    <1578>   DW_AT_sibling     : <0x1597>
 <2><157c>: Abbrev Number: 22 (DW_TAG_member)
    <157d>   DW_AT_name        : (indirect string, offset: 0x38c6c): _base
    <1581>   DW_AT_decl_file   : 7
    <1582>   DW_AT_decl_line   : 123
    <1583>   DW_AT_decl_column : 17
    <1584>   DW_AT_type        : <0x1597>
    <1588>   DW_AT_data_member_location: 0
 <2><1589>: Abbrev Number: 22 (DW_TAG_member)
    <158a>   DW_AT_name        : (indirect string, offset: 0x38e58): _size
    <158e>   DW_AT_decl_file   : 7
    <158f>   DW_AT_decl_line   : 124
    <1590>   DW_AT_decl_column : 6
    <1591>   DW_AT_type        : <0x1171>
    <1595>   DW_AT_data_member_location: 4
 <2><1596>: Abbrev Number: 0
 <1><1597>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <1598>   DW_AT_byte_size   : 4
    <1599>   DW_AT_type        : <0x1128>
 <1><159d>: Abbrev Number: 27 (DW_TAG_structure_type)
    <159e>   DW_AT_name        : (indirect string, offset: 0x38c00): _reent
    <15a2>   DW_AT_byte_size   : 96
    <15a3>   DW_AT_decl_file   : 7
    <15a4>   DW_AT_decl_line   : 377
    <15a6>   DW_AT_decl_column : 8
    <15a7>   DW_AT_sibling     : <0x16e0>
 <2><15ab>: Abbrev Number: 8 (DW_TAG_member)
    <15ac>   DW_AT_name        : (indirect string, offset: 0x38aa8): _errno
    <15b0>   DW_AT_decl_file   : 7
    <15b1>   DW_AT_decl_line   : 381
    <15b3>   DW_AT_decl_column : 7
    <15b4>   DW_AT_type        : <0x1171>
    <15b8>   DW_AT_data_member_location: 0
 <2><15b9>: Abbrev Number: 8 (DW_TAG_member)
    <15ba>   DW_AT_name        : (indirect string, offset: 0x38b2f): _stdin
    <15be>   DW_AT_decl_file   : 7
    <15bf>   DW_AT_decl_line   : 386
    <15c1>   DW_AT_decl_column : 11
    <15c2>   DW_AT_type        : <0x1933>
    <15c6>   DW_AT_data_member_location: 4
 <2><15c7>: Abbrev Number: 8 (DW_TAG_member)
    <15c8>   DW_AT_name        : (indirect string, offset: 0x38e3e): _stdout
    <15cc>   DW_AT_decl_file   : 7
    <15cd>   DW_AT_decl_line   : 386
    <15cf>   DW_AT_decl_column : 20
    <15d0>   DW_AT_type        : <0x1933>
    <15d4>   DW_AT_data_member_location: 8
 <2><15d5>: Abbrev Number: 8 (DW_TAG_member)
    <15d6>   DW_AT_name        : (indirect string, offset: 0x38eaa): _stderr
    <15da>   DW_AT_decl_file   : 7
    <15db>   DW_AT_decl_line   : 386
    <15dd>   DW_AT_decl_column : 30
    <15de>   DW_AT_type        : <0x1933>
    <15e2>   DW_AT_data_member_location: 12
 <2><15e3>: Abbrev Number: 8 (DW_TAG_member)
    <15e4>   DW_AT_name        : (indirect string, offset: 0x38bf6): _inc
    <15e8>   DW_AT_decl_file   : 7
    <15e9>   DW_AT_decl_line   : 388
    <15eb>   DW_AT_decl_column : 8
    <15ec>   DW_AT_type        : <0x1171>
    <15f0>   DW_AT_data_member_location: 16
 <2><15f1>: Abbrev Number: 8 (DW_TAG_member)
    <15f2>   DW_AT_name        : (indirect string, offset: 0x38d5c): _emergency
    <15f6>   DW_AT_decl_file   : 7
    <15f7>   DW_AT_decl_line   : 390
    <15f9>   DW_AT_decl_column : 9
    <15fa>   DW_AT_type        : <0x1847>
    <15fe>   DW_AT_data_member_location: 20
 <2><15ff>: Abbrev Number: 8 (DW_TAG_member)
    <1600>   DW_AT_name        : (indirect string, offset: 0x38dcc): __sdidinit
    <1604>   DW_AT_decl_file   : 7
    <1605>   DW_AT_decl_line   : 392
    <1607>   DW_AT_decl_column : 7
    <1608>   DW_AT_type        : <0x1171>
    <160c>   DW_AT_data_member_location: 24
 <2><160d>: Abbrev Number: 8 (DW_TAG_member)
    <160e>   DW_AT_name        : (indirect string, offset: 0x38b76): _unspecified_locale_info
    <1612>   DW_AT_decl_file   : 7
    <1613>   DW_AT_decl_line   : 394
    <1615>   DW_AT_decl_column : 7
    <1616>   DW_AT_type        : <0x1171>
    <161a>   DW_AT_data_member_location: 28
 <2><161b>: Abbrev Number: 8 (DW_TAG_member)
    <161c>   DW_AT_name        : (indirect string, offset: 0x38c5c): _locale
    <1620>   DW_AT_decl_file   : 7
    <1621>   DW_AT_decl_line   : 395
    <1623>   DW_AT_decl_column : 22
    <1624>   DW_AT_type        : <0x1a9b>
    <1628>   DW_AT_data_member_location: 32
 <2><1629>: Abbrev Number: 9 (DW_TAG_member)
    <162a>   DW_AT_name        : _mp
    <162e>   DW_AT_decl_file   : 7
    <162f>   DW_AT_decl_line   : 397
    <1631>   DW_AT_decl_column : 18
    <1632>   DW_AT_type        : <0x1aa1>
    <1636>   DW_AT_data_member_location: 36
 <2><1637>: Abbrev Number: 8 (DW_TAG_member)
    <1638>   DW_AT_name        : (indirect string, offset: 0x38c14): __cleanup
    <163c>   DW_AT_decl_file   : 7
    <163d>   DW_AT_decl_line   : 399
    <163f>   DW_AT_decl_column : 10
    <1640>   DW_AT_type        : <0x1ab2>
    <1644>   DW_AT_data_member_location: 40
 <2><1645>: Abbrev Number: 8 (DW_TAG_member)
    <1646>   DW_AT_name        : (indirect string, offset: 0x38d8d): _gamma_signgam
    <164a>   DW_AT_decl_file   : 7
    <164b>   DW_AT_decl_line   : 401
    <164d>   DW_AT_decl_column : 7
    <164e>   DW_AT_type        : <0x1171>
    <1652>   DW_AT_data_member_location: 44
 <2><1653>: Abbrev Number: 8 (DW_TAG_member)
    <1654>   DW_AT_name        : (indirect string, offset: 0x38bd0): _cvtlen
    <1658>   DW_AT_decl_file   : 7
    <1659>   DW_AT_decl_line   : 404
    <165b>   DW_AT_decl_column : 7
    <165c>   DW_AT_type        : <0x1171>
    <1660>   DW_AT_data_member_location: 48
 <2><1661>: Abbrev Number: 8 (DW_TAG_member)
    <1662>   DW_AT_name        : (indirect string, offset: 0x38b55): _cvtbuf
    <1666>   DW_AT_decl_file   : 7
    <1667>   DW_AT_decl_line   : 405
    <1669>   DW_AT_decl_column : 9
    <166a>   DW_AT_type        : <0x1847>
    <166e>   DW_AT_data_member_location: 52
 <2><166f>: Abbrev Number: 8 (DW_TAG_member)
    <1670>   DW_AT_name        : (indirect string, offset: 0x38c7b): _r48
    <1674>   DW_AT_decl_file   : 7
    <1675>   DW_AT_decl_line   : 407
    <1677>   DW_AT_decl_column : 19
    <1678>   DW_AT_type        : <0x1ab8>
    <167c>   DW_AT_data_member_location: 56
 <2><167d>: Abbrev Number: 8 (DW_TAG_member)
    <167e>   DW_AT_name        : (indirect string, offset: 0x38e5e): _localtime_buf
    <1682>   DW_AT_decl_file   : 7
    <1683>   DW_AT_decl_line   : 408
    <1685>   DW_AT_decl_column : 16
    <1686>   DW_AT_type        : <0x1abe>
    <168a>   DW_AT_data_member_location: 60
 <2><168b>: Abbrev Number: 8 (DW_TAG_member)
    <168c>   DW_AT_name        : (indirect string, offset: 0x38b3b): _asctime_buf
    <1690>   DW_AT_decl_file   : 7
    <1691>   DW_AT_decl_line   : 409
    <1693>   DW_AT_decl_column : 9
    <1694>   DW_AT_type        : <0x1847>
    <1698>   DW_AT_data_member_location: 64
 <2><1699>: Abbrev Number: 8 (DW_TAG_member)
    <169a>   DW_AT_name        : (indirect string, offset: 0x38e2d): _sig_func
    <169e>   DW_AT_decl_file   : 7
    <169f>   DW_AT_decl_line   : 412
    <16a1>   DW_AT_decl_column : 12
    <16a2>   DW_AT_type        : <0x1acf>
    <16a6>   DW_AT_data_member_location: 68
 <2><16a7>: Abbrev Number: 8 (DW_TAG_member)
    <16a8>   DW_AT_name        : (indirect string, offset: 0x38ac4): __sglue
    <16ac>   DW_AT_decl_file   : 7
    <16ad>   DW_AT_decl_line   : 420
    <16af>   DW_AT_decl_column : 16
    <16b0>   DW_AT_type        : <0x18f4>
    <16b4>   DW_AT_data_member_location: 72
 <2><16b5>: Abbrev Number: 8 (DW_TAG_member)
    <16b6>   DW_AT_name        : (indirect string, offset: 0x38cd9): __sf
    <16ba>   DW_AT_decl_file   : 7
    <16bb>   DW_AT_decl_line   : 421
    <16bd>   DW_AT_decl_column : 11
    <16be>   DW_AT_type        : <0x1933>
    <16c2>   DW_AT_data_member_location: 84
 <2><16c3>: Abbrev Number: 8 (DW_TAG_member)
    <16c4>   DW_AT_name        : (indirect string, offset: 0x38d56): _misc
    <16c8>   DW_AT_decl_file   : 7
    <16c9>   DW_AT_decl_line   : 422
    <16cb>   DW_AT_decl_column : 23
    <16cc>   DW_AT_type        : <0x1adb>
    <16d0>   DW_AT_data_member_location: 88
 <2><16d1>: Abbrev Number: 8 (DW_TAG_member)
    <16d2>   DW_AT_name        : (indirect string, offset: 0x38e4c): _signal_buf
    <16d6>   DW_AT_decl_file   : 7
    <16d7>   DW_AT_decl_line   : 423
    <16d9>   DW_AT_decl_column : 9
    <16da>   DW_AT_type        : <0x1847>
    <16de>   DW_AT_data_member_location: 92
 <2><16df>: Abbrev Number: 0
 <1><16e0>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <16e1>   DW_AT_byte_size   : 4
    <16e2>   DW_AT_type        : <0x159d>
 <1><16e6>: Abbrev Number: 25 (DW_TAG_structure_type)
    <16e7>   DW_AT_name        : (indirect string, offset: 0x38c64): __sFILE
    <16eb>   DW_AT_byte_size   : 104
    <16ec>   DW_AT_decl_file   : 7
    <16ed>   DW_AT_decl_line   : 186
    <16ee>   DW_AT_decl_column : 8
    <16ef>   DW_AT_sibling     : <0x1829>
 <2><16f3>: Abbrev Number: 26 (DW_TAG_member)
    <16f4>   DW_AT_name        : _p
    <16f7>   DW_AT_decl_file   : 7
    <16f8>   DW_AT_decl_line   : 187
    <16f9>   DW_AT_decl_column : 18
    <16fa>   DW_AT_type        : <0x1597>
    <16fe>   DW_AT_data_member_location: 0
 <2><16ff>: Abbrev Number: 26 (DW_TAG_member)
    <1700>   DW_AT_name        : _r
    <1703>   DW_AT_decl_file   : 7
    <1704>   DW_AT_decl_line   : 188
    <1705>   DW_AT_decl_column : 7
    <1706>   DW_AT_type        : <0x1171>
    <170a>   DW_AT_data_member_location: 4
 <2><170b>: Abbrev Number: 26 (DW_TAG_member)
    <170c>   DW_AT_name        : _w
    <170f>   DW_AT_decl_file   : 7
    <1710>   DW_AT_decl_line   : 189
    <1711>   DW_AT_decl_column : 7
    <1712>   DW_AT_type        : <0x1171>
    <1716>   DW_AT_data_member_location: 8
 <2><1717>: Abbrev Number: 22 (DW_TAG_member)
    <1718>   DW_AT_name        : (indirect string, offset: 0x38dff): _flags
    <171c>   DW_AT_decl_file   : 7
    <171d>   DW_AT_decl_line   : 190
    <171e>   DW_AT_decl_column : 9
    <171f>   DW_AT_type        : <0x112f>
    <1723>   DW_AT_data_member_location: 12
 <2><1724>: Abbrev Number: 22 (DW_TAG_member)
    <1725>   DW_AT_name        : (indirect string, offset: 0x38ae1): _file
    <1729>   DW_AT_decl_file   : 7
    <172a>   DW_AT_decl_line   : 191
    <172b>   DW_AT_decl_column : 9
    <172c>   DW_AT_type        : <0x112f>
    <1730>   DW_AT_data_member_location: 14
 <2><1731>: Abbrev Number: 26 (DW_TAG_member)
    <1732>   DW_AT_name        : _bf
    <1736>   DW_AT_decl_file   : 7
    <1737>   DW_AT_decl_line   : 192
    <1738>   DW_AT_decl_column : 17
    <1739>   DW_AT_type        : <0x156f>
    <173d>   DW_AT_data_member_location: 16
 <2><173e>: Abbrev Number: 22 (DW_TAG_member)
    <173f>   DW_AT_name        : (indirect string, offset: 0x38a9f): _lbfsize
    <1743>   DW_AT_decl_file   : 7
    <1744>   DW_AT_decl_line   : 193
    <1745>   DW_AT_decl_column : 7
    <1746>   DW_AT_type        : <0x1171>
    <174a>   DW_AT_data_member_location: 24
 <2><174b>: Abbrev Number: 22 (DW_TAG_member)
    <174c>   DW_AT_name        : (indirect string, offset: 0x38b4f): _data
    <1750>   DW_AT_decl_file   : 7
    <1751>   DW_AT_decl_line   : 196
    <1752>   DW_AT_decl_column : 18
    <1753>   DW_AT_type        : <0x16e0>
    <1757>   DW_AT_data_member_location: 28
 <2><1758>: Abbrev Number: 22 (DW_TAG_member)
    <1759>   DW_AT_name        : (indirect string, offset: 0x38e06): _cookie
    <175d>   DW_AT_decl_file   : 7
    <175e>   DW_AT_decl_line   : 200
    <175f>   DW_AT_decl_column : 10
    <1760>   DW_AT_type        : <0x13c4>
    <1764>   DW_AT_data_member_location: 32
 <2><1765>: Abbrev Number: 22 (DW_TAG_member)
    <1766>   DW_AT_name        : (indirect string, offset: 0x38bb8): _read
    <176a>   DW_AT_decl_file   : 7
    <176b>   DW_AT_decl_line   : 202
    <176c>   DW_AT_decl_column : 29
    <176d>   DW_AT_type        : <0x1859>
    <1771>   DW_AT_data_member_location: 36
 <2><1772>: Abbrev Number: 22 (DW_TAG_member)
    <1773>   DW_AT_name        : (indirect string, offset: 0x38df8): _write
    <1777>   DW_AT_decl_file   : 7
    <1778>   DW_AT_decl_line   : 204
    <1779>   DW_AT_decl_column : 29
    <177a>   DW_AT_type        : <0x1883>
    <177e>   DW_AT_data_member_location: 40
 <2><177f>: Abbrev Number: 22 (DW_TAG_member)
    <1780>   DW_AT_name        : (indirect string, offset: 0x38cbc): _seek
    <1784>   DW_AT_decl_file   : 7
    <1785>   DW_AT_decl_line   : 207
    <1786>   DW_AT_decl_column : 13
    <1787>   DW_AT_type        : <0x18a7>
    <178b>   DW_AT_data_member_location: 44
 <2><178c>: Abbrev Number: 22 (DW_TAG_member)
    <178d>   DW_AT_name        : (indirect string, offset: 0x38b48): _close
    <1791>   DW_AT_decl_file   : 7
    <1792>   DW_AT_decl_line   : 208
    <1793>   DW_AT_decl_column : 9
    <1794>   DW_AT_type        : <0x18c1>
    <1798>   DW_AT_data_member_location: 48
 <2><1799>: Abbrev Number: 26 (DW_TAG_member)
    <179a>   DW_AT_name        : _ub
    <179e>   DW_AT_decl_file   : 7
    <179f>   DW_AT_decl_line   : 211
    <17a0>   DW_AT_decl_column : 17
    <17a1>   DW_AT_type        : <0x156f>
    <17a5>   DW_AT_data_member_location: 52
 <2><17a6>: Abbrev Number: 26 (DW_TAG_member)
    <17a7>   DW_AT_name        : _up
    <17ab>   DW_AT_decl_file   : 7
    <17ac>   DW_AT_decl_line   : 212
    <17ad>   DW_AT_decl_column : 18
    <17ae>   DW_AT_type        : <0x1597>
    <17b2>   DW_AT_data_member_location: 60
 <2><17b3>: Abbrev Number: 26 (DW_TAG_member)
    <17b4>   DW_AT_name        : _ur
    <17b8>   DW_AT_decl_file   : 7
    <17b9>   DW_AT_decl_line   : 213
    <17ba>   DW_AT_decl_column : 7
    <17bb>   DW_AT_type        : <0x1171>
    <17bf>   DW_AT_data_member_location: 64
 <2><17c0>: Abbrev Number: 22 (DW_TAG_member)
    <17c1>   DW_AT_name        : (indirect string, offset: 0x38cb6): _ubuf
    <17c5>   DW_AT_decl_file   : 7
    <17c6>   DW_AT_decl_line   : 216
    <17c7>   DW_AT_decl_column : 17
    <17c8>   DW_AT_type        : <0x18c7>
    <17cc>   DW_AT_data_member_location: 68
 <2><17cd>: Abbrev Number: 22 (DW_TAG_member)
    <17ce>   DW_AT_name        : (indirect string, offset: 0x38ae7): _nbuf
    <17d2>   DW_AT_decl_file   : 7
    <17d3>   DW_AT_decl_line   : 217
    <17d4>   DW_AT_decl_column : 17
    <17d5>   DW_AT_type        : <0x18d7>
    <17d9>   DW_AT_data_member_location: 71
 <2><17da>: Abbrev Number: 26 (DW_TAG_member)
    <17db>   DW_AT_name        : _lb
    <17df>   DW_AT_decl_file   : 7
    <17e0>   DW_AT_decl_line   : 220
    <17e1>   DW_AT_decl_column : 17
    <17e2>   DW_AT_type        : <0x156f>
    <17e6>   DW_AT_data_member_location: 72
 <2><17e7>: Abbrev Number: 22 (DW_TAG_member)
    <17e8>   DW_AT_name        : (indirect string, offset: 0x38a96): _blksize
    <17ec>   DW_AT_decl_file   : 7
    <17ed>   DW_AT_decl_line   : 223
    <17ee>   DW_AT_decl_column : 7
    <17ef>   DW_AT_type        : <0x1171>
    <17f3>   DW_AT_data_member_location: 80
 <2><17f4>: Abbrev Number: 22 (DW_TAG_member)
    <17f5>   DW_AT_name        : (indirect string, offset: 0x38cae): _offset
    <17f9>   DW_AT_decl_file   : 7
    <17fa>   DW_AT_decl_line   : 224
    <17fb>   DW_AT_decl_column : 10
    <17fc>   DW_AT_type        : <0x13d3>
    <1800>   DW_AT_data_member_location: 84
 <2><1801>: Abbrev Number: 22 (DW_TAG_member)
    <1802>   DW_AT_name        : (indirect string, offset: 0x38f2a): _lock
    <1806>   DW_AT_decl_file   : 7
    <1807>   DW_AT_decl_line   : 231
    <1808>   DW_AT_decl_column : 12
    <1809>   DW_AT_type        : <0x1470>
    <180d>   DW_AT_data_member_location: 88
 <2><180e>: Abbrev Number: 22 (DW_TAG_member)
    <180f>   DW_AT_name        : (indirect string, offset: 0x38ced): _mbstate
    <1813>   DW_AT_decl_file   : 7
    <1814>   DW_AT_decl_line   : 233
    <1815>   DW_AT_decl_column : 14
    <1816>   DW_AT_type        : <0x1441>
    <181a>   DW_AT_data_member_location: 92
 <2><181b>: Abbrev Number: 22 (DW_TAG_member)
    <181c>   DW_AT_name        : (indirect string, offset: 0x38d78): _flags2
    <1820>   DW_AT_decl_file   : 7
    <1821>   DW_AT_decl_line   : 234
    <1822>   DW_AT_decl_column : 9
    <1823>   DW_AT_type        : <0x1171>
    <1827>   DW_AT_data_member_location: 100
 <2><1828>: Abbrev Number: 0
 <1><1829>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <182a>   DW_AT_prototyped  : 1
    <182a>   DW_AT_type        : <0x1171>
    <182e>   DW_AT_sibling     : <0x1847>
 <2><1832>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <1833>   DW_AT_type        : <0x16e0>
 <2><1837>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <1838>   DW_AT_type        : <0x13c4>
 <2><183c>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <183d>   DW_AT_type        : <0x1847>
 <2><1841>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <1842>   DW_AT_type        : <0x1171>
 <2><1846>: Abbrev Number: 0
 <1><1847>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <1848>   DW_AT_byte_size   : 4
    <1849>   DW_AT_type        : <0x184d>
 <1><184d>: Abbrev Number: 2 (DW_TAG_base_type)
    <184e>   DW_AT_byte_size   : 1
    <184f>   DW_AT_encoding    : 8	(unsigned char)
    <1850>   DW_AT_name        : (indirect string, offset: 0x2ab43): char
 <1><1854>: Abbrev Number: 6 (DW_TAG_const_type)
    <1855>   DW_AT_type        : <0x184d>
 <1><1859>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <185a>   DW_AT_byte_size   : 4
    <185b>   DW_AT_type        : <0x1829>
 <1><185f>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <1860>   DW_AT_prototyped  : 1
    <1860>   DW_AT_type        : <0x1171>
    <1864>   DW_AT_sibling     : <0x187d>
 <2><1868>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <1869>   DW_AT_type        : <0x16e0>
 <2><186d>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <186e>   DW_AT_type        : <0x13c4>
 <2><1872>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <1873>   DW_AT_type        : <0x187d>
 <2><1877>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <1878>   DW_AT_type        : <0x1171>
 <2><187c>: Abbrev Number: 0
 <1><187d>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <187e>   DW_AT_byte_size   : 4
    <187f>   DW_AT_type        : <0x1854>
 <1><1883>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <1884>   DW_AT_byte_size   : 4
    <1885>   DW_AT_type        : <0x185f>
 <1><1889>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <188a>   DW_AT_prototyped  : 1
    <188a>   DW_AT_type        : <0x13df>
    <188e>   DW_AT_sibling     : <0x18a7>
 <2><1892>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <1893>   DW_AT_type        : <0x16e0>
 <2><1897>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <1898>   DW_AT_type        : <0x13c4>
 <2><189c>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <189d>   DW_AT_type        : <0x13df>
 <2><18a1>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <18a2>   DW_AT_type        : <0x1171>
 <2><18a6>: Abbrev Number: 0
 <1><18a7>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <18a8>   DW_AT_byte_size   : 4
    <18a9>   DW_AT_type        : <0x1889>
 <1><18ad>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <18ae>   DW_AT_prototyped  : 1
    <18ae>   DW_AT_type        : <0x1171>
    <18b2>   DW_AT_sibling     : <0x18c1>
 <2><18b6>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <18b7>   DW_AT_type        : <0x16e0>
 <2><18bb>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <18bc>   DW_AT_type        : <0x13c4>
 <2><18c0>: Abbrev Number: 0
 <1><18c1>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <18c2>   DW_AT_byte_size   : 4
    <18c3>   DW_AT_type        : <0x18ad>
 <1><18c7>: Abbrev Number: 19 (DW_TAG_array_type)
    <18c8>   DW_AT_type        : <0x1128>
    <18cc>   DW_AT_sibling     : <0x18d7>
 <2><18d0>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <18d1>   DW_AT_type        : <0x1178>
    <18d5>   DW_AT_upper_bound : 2
 <2><18d6>: Abbrev Number: 0
 <1><18d7>: Abbrev Number: 19 (DW_TAG_array_type)
    <18d8>   DW_AT_type        : <0x1128>
    <18dc>   DW_AT_sibling     : <0x18e7>
 <2><18e0>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <18e1>   DW_AT_type        : <0x1178>
    <18e5>   DW_AT_upper_bound : 0
 <2><18e6>: Abbrev Number: 0
 <1><18e7>: Abbrev Number: 10 (DW_TAG_typedef)
    <18e8>   DW_AT_name        : (indirect string, offset: 0x38be1): __FILE
    <18ec>   DW_AT_decl_file   : 7
    <18ed>   DW_AT_decl_line   : 292
    <18ef>   DW_AT_decl_column : 26
    <18f0>   DW_AT_type        : <0x16e6>
 <1><18f4>: Abbrev Number: 27 (DW_TAG_structure_type)
    <18f5>   DW_AT_name        : (indirect string, offset: 0x38bf0): _glue
    <18f9>   DW_AT_byte_size   : 12
    <18fa>   DW_AT_decl_file   : 7
    <18fb>   DW_AT_decl_line   : 296
    <18fd>   DW_AT_decl_column : 8
    <18fe>   DW_AT_sibling     : <0x192d>
 <2><1902>: Abbrev Number: 8 (DW_TAG_member)
    <1903>   DW_AT_name        : (indirect string, offset: 0x38f23): _next
    <1907>   DW_AT_decl_file   : 7
    <1908>   DW_AT_decl_line   : 298
    <190a>   DW_AT_decl_column : 17
    <190b>   DW_AT_type        : <0x192d>
    <190f>   DW_AT_data_member_location: 0
 <2><1910>: Abbrev Number: 8 (DW_TAG_member)
    <1911>   DW_AT_name        : (indirect string, offset: 0x38db9): _niobs
    <1915>   DW_AT_decl_file   : 7
    <1916>   DW_AT_decl_line   : 299
    <1918>   DW_AT_decl_column : 7
    <1919>   DW_AT_type        : <0x1171>
    <191d>   DW_AT_data_member_location: 4
 <2><191e>: Abbrev Number: 8 (DW_TAG_member)
    <191f>   DW_AT_name        : (indirect string, offset: 0x38ea4): _iobs
    <1923>   DW_AT_decl_file   : 7
    <1924>   DW_AT_decl_line   : 300
    <1926>   DW_AT_decl_column : 11
    <1927>   DW_AT_type        : <0x1933>
    <192b>   DW_AT_data_member_location: 8
 <2><192c>: Abbrev Number: 0
 <1><192d>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <192e>   DW_AT_byte_size   : 4
    <192f>   DW_AT_type        : <0x18f4>
 <1><1933>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <1934>   DW_AT_byte_size   : 4
    <1935>   DW_AT_type        : <0x18e7>
 <1><1939>: Abbrev Number: 27 (DW_TAG_structure_type)
    <193a>   DW_AT_name        : (indirect string, offset: 0x38e9c): _rand48
    <193e>   DW_AT_byte_size   : 24
    <193f>   DW_AT_decl_file   : 7
    <1940>   DW_AT_decl_line   : 324
    <1942>   DW_AT_decl_column : 8
    <1943>   DW_AT_sibling     : <0x1980>
 <2><1947>: Abbrev Number: 8 (DW_TAG_member)
    <1948>   DW_AT_name        : (indirect string, offset: 0x38d72): _seed
    <194c>   DW_AT_decl_file   : 7
    <194d>   DW_AT_decl_line   : 325
    <194f>   DW_AT_decl_column : 18
    <1950>   DW_AT_type        : <0x1980>
    <1954>   DW_AT_data_member_location: 0
 <2><1955>: Abbrev Number: 8 (DW_TAG_member)
    <1956>   DW_AT_name        : (indirect string, offset: 0x38af2): _mult
    <195a>   DW_AT_decl_file   : 7
    <195b>   DW_AT_decl_line   : 326
    <195d>   DW_AT_decl_column : 18
    <195e>   DW_AT_type        : <0x1980>
    <1962>   DW_AT_data_member_location: 6
 <2><1963>: Abbrev Number: 8 (DW_TAG_member)
    <1964>   DW_AT_name        : (indirect string, offset: 0x38acc): _add
    <1968>   DW_AT_decl_file   : 7
    <1969>   DW_AT_decl_line   : 327
    <196b>   DW_AT_decl_column : 18
    <196c>   DW_AT_type        : <0x1142>
    <1970>   DW_AT_data_member_location: 12
 <2><1971>: Abbrev Number: 8 (DW_TAG_member)
    <1972>   DW_AT_name        : (indirect string, offset: 0x38f1e): _rand_next
    <1976>   DW_AT_decl_file   : 7
    <1977>   DW_AT_decl_line   : 330
    <1979>   DW_AT_decl_column : 36
    <197a>   DW_AT_type        : <0x116a>
    <197e>   DW_AT_data_member_location: 16
 <2><197f>: Abbrev Number: 0
 <1><1980>: Abbrev Number: 19 (DW_TAG_array_type)
    <1981>   DW_AT_type        : <0x1142>
    <1985>   DW_AT_sibling     : <0x1990>
 <2><1989>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <198a>   DW_AT_type        : <0x1178>
    <198e>   DW_AT_upper_bound : 2
 <2><198f>: Abbrev Number: 0
 <1><1990>: Abbrev Number: 27 (DW_TAG_structure_type)
    <1991>   DW_AT_name        : (indirect string, offset: 0x38e8b): _mprec
    <1995>   DW_AT_byte_size   : 16
    <1996>   DW_AT_decl_file   : 7
    <1997>   DW_AT_decl_line   : 349
    <1999>   DW_AT_decl_column : 8
    <199a>   DW_AT_sibling     : <0x19d7>
 <2><199e>: Abbrev Number: 8 (DW_TAG_member)
    <199f>   DW_AT_name        : (indirect string, offset: 0x38b64): _result
    <19a3>   DW_AT_decl_file   : 7
    <19a4>   DW_AT_decl_line   : 352
    <19a6>   DW_AT_decl_column : 19
    <19a7>   DW_AT_type        : <0x14d6>
    <19ab>   DW_AT_data_member_location: 0
 <2><19ac>: Abbrev Number: 8 (DW_TAG_member)
    <19ad>   DW_AT_name        : (indirect string, offset: 0x38e78): _result_k
    <19b1>   DW_AT_decl_file   : 7
    <19b2>   DW_AT_decl_line   : 353
    <19b4>   DW_AT_decl_column : 7
    <19b5>   DW_AT_type        : <0x1171>
    <19b9>   DW_AT_data_member_location: 4
 <2><19ba>: Abbrev Number: 8 (DW_TAG_member)
    <19bb>   DW_AT_name        : (indirect string, offset: 0x38a89): _p5s
    <19bf>   DW_AT_decl_file   : 7
    <19c0>   DW_AT_decl_line   : 354
    <19c2>   DW_AT_decl_column : 19
    <19c3>   DW_AT_type        : <0x14d6>
    <19c7>   DW_AT_data_member_location: 8
 <2><19c8>: Abbrev Number: 8 (DW_TAG_member)
    <19c9>   DW_AT_name        : (indirect string, offset: 0x38ad7): _freelist
    <19cd>   DW_AT_decl_file   : 7
    <19ce>   DW_AT_decl_line   : 355
    <19d0>   DW_AT_decl_column : 20
    <19d1>   DW_AT_type        : <0x19d7>
    <19d5>   DW_AT_data_member_location: 12
 <2><19d6>: Abbrev Number: 0
 <1><19d7>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <19d8>   DW_AT_byte_size   : 4
    <19d9>   DW_AT_type        : <0x14d6>
 <1><19dd>: Abbrev Number: 27 (DW_TAG_structure_type)
    <19de>   DW_AT_name        : (indirect string, offset: 0x38bfb): _misc_reent
    <19e2>   DW_AT_byte_size   : 80
    <19e3>   DW_AT_decl_file   : 7
    <19e4>   DW_AT_decl_line   : 359
    <19e6>   DW_AT_decl_column : 8
    <19e7>   DW_AT_sibling     : <0x1a86>
 <2><19eb>: Abbrev Number: 8 (DW_TAG_member)
    <19ec>   DW_AT_name        : (indirect string, offset: 0x38b17): _strtok_last
    <19f0>   DW_AT_decl_file   : 7
    <19f1>   DW_AT_decl_line   : 362
    <19f3>   DW_AT_decl_column : 9
    <19f4>   DW_AT_type        : <0x1847>
    <19f8>   DW_AT_data_member_location: 0
 <2><19f9>: Abbrev Number: 8 (DW_TAG_member)
    <19fa>   DW_AT_name        : (indirect string, offset: 0x38b8f): _mblen_state
    <19fe>   DW_AT_decl_file   : 7
    <19ff>   DW_AT_decl_line   : 363
    <1a01>   DW_AT_decl_column : 14
    <1a02>   DW_AT_type        : <0x1441>
    <1a06>   DW_AT_data_member_location: 4
 <2><1a07>: Abbrev Number: 8 (DW_TAG_member)
    <1a08>   DW_AT_name        : (indirect string, offset: 0x38ee1): _wctomb_state
    <1a0c>   DW_AT_decl_file   : 7
    <1a0d>   DW_AT_decl_line   : 364
    <1a0f>   DW_AT_decl_column : 14
    <1a10>   DW_AT_type        : <0x1441>
    <1a14>   DW_AT_data_member_location: 12
 <2><1a15>: Abbrev Number: 8 (DW_TAG_member)
    <1a16>   DW_AT_name        : (indirect string, offset: 0x38e1f): _mbtowc_state
    <1a1a>   DW_AT_decl_file   : 7
    <1a1b>   DW_AT_decl_line   : 365
    <1a1d>   DW_AT_decl_column : 14
    <1a1e>   DW_AT_type        : <0x1441>
    <1a22>   DW_AT_data_member_location: 20
 <2><1a23>: Abbrev Number: 8 (DW_TAG_member)
    <1a24>   DW_AT_name        : (indirect string, offset: 0x38ce3): _l64a_buf
    <1a28>   DW_AT_decl_file   : 7
    <1a29>   DW_AT_decl_line   : 366
    <1a2b>   DW_AT_decl_column : 8
    <1a2c>   DW_AT_type        : <0x1a86>
    <1a30>   DW_AT_data_member_location: 28
 <2><1a31>: Abbrev Number: 8 (DW_TAG_member)
    <1a32>   DW_AT_name        : (indirect string, offset: 0x38c07): _getdate_err
    <1a36>   DW_AT_decl_file   : 7
    <1a37>   DW_AT_decl_line   : 367
    <1a39>   DW_AT_decl_column : 7
    <1a3a>   DW_AT_type        : <0x1171>
    <1a3e>   DW_AT_data_member_location: 36
 <2><1a3f>: Abbrev Number: 8 (DW_TAG_member)
    <1a40>   DW_AT_name        : (indirect string, offset: 0x38b09): _mbrlen_state
    <1a44>   DW_AT_decl_file   : 7
    <1a45>   DW_AT_decl_line   : 368
    <1a47>   DW_AT_decl_column : 14
    <1a48>   DW_AT_type        : <0x1441>
    <1a4c>   DW_AT_data_member_location: 40
 <2><1a4d>: Abbrev Number: 8 (DW_TAG_member)
    <1a4e>   DW_AT_name        : (indirect string, offset: 0x38c9f): _mbrtowc_state
    <1a52>   DW_AT_decl_file   : 7
    <1a53>   DW_AT_decl_line   : 369
    <1a55>   DW_AT_decl_column : 14
    <1a56>   DW_AT_type        : <0x1441>
    <1a5a>   DW_AT_data_member_location: 48
 <2><1a5b>: Abbrev Number: 8 (DW_TAG_member)
    <1a5c>   DW_AT_name        : (indirect string, offset: 0x38ec6): _mbsrtowcs_state
    <1a60>   DW_AT_decl_file   : 7
    <1a61>   DW_AT_decl_line   : 370
    <1a63>   DW_AT_decl_column : 14
    <1a64>   DW_AT_type        : <0x1441>
    <1a68>   DW_AT_data_member_location: 56
 <2><1a69>: Abbrev Number: 8 (DW_TAG_member)
    <1a6a>   DW_AT_name        : (indirect string, offset: 0x38d9c): _wcrtomb_state
    <1a6e>   DW_AT_decl_file   : 7
    <1a6f>   DW_AT_decl_line   : 371
    <1a71>   DW_AT_decl_column : 14
    <1a72>   DW_AT_type        : <0x1441>
    <1a76>   DW_AT_data_member_location: 64
 <2><1a77>: Abbrev Number: 8 (DW_TAG_member)
    <1a78>   DW_AT_name        : (indirect string, offset: 0x38e0e): _wcsrtombs_state
    <1a7c>   DW_AT_decl_file   : 7
    <1a7d>   DW_AT_decl_line   : 372
    <1a7f>   DW_AT_decl_column : 14
    <1a80>   DW_AT_type        : <0x1441>
    <1a84>   DW_AT_data_member_location: 72
 <2><1a85>: Abbrev Number: 0
 <1><1a86>: Abbrev Number: 19 (DW_TAG_array_type)
    <1a87>   DW_AT_type        : <0x184d>
    <1a8b>   DW_AT_sibling     : <0x1a96>
 <2><1a8f>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <1a90>   DW_AT_type        : <0x1178>
    <1a94>   DW_AT_upper_bound : 7
 <2><1a95>: Abbrev Number: 0
 <1><1a96>: Abbrev Number: 24 (DW_TAG_structure_type)
    <1a97>   DW_AT_name        : (indirect string, offset: 0x38ddc): __locale_t
    <1a9b>   DW_AT_declaration : 1
 <1><1a9b>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <1a9c>   DW_AT_byte_size   : 4
    <1a9d>   DW_AT_type        : <0x1a96>
 <1><1aa1>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <1aa2>   DW_AT_byte_size   : 4
    <1aa3>   DW_AT_type        : <0x1990>
 <1><1aa7>: Abbrev Number: 30 (DW_TAG_subroutine_type)
    <1aa8>   DW_AT_prototyped  : 1
    <1aa8>   DW_AT_sibling     : <0x1ab2>
 <2><1aac>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <1aad>   DW_AT_type        : <0x16e0>
 <2><1ab1>: Abbrev Number: 0
 <1><1ab2>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <1ab3>   DW_AT_byte_size   : 4
    <1ab4>   DW_AT_type        : <0x1aa7>
 <1><1ab8>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <1ab9>   DW_AT_byte_size   : 4
    <1aba>   DW_AT_type        : <0x1939>
 <1><1abe>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <1abf>   DW_AT_byte_size   : 4
    <1ac0>   DW_AT_type        : <0x14ec>
 <1><1ac4>: Abbrev Number: 30 (DW_TAG_subroutine_type)
    <1ac5>   DW_AT_prototyped  : 1
    <1ac5>   DW_AT_sibling     : <0x1acf>
 <2><1ac9>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <1aca>   DW_AT_type        : <0x1171>
 <2><1ace>: Abbrev Number: 0
 <1><1acf>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <1ad0>   DW_AT_byte_size   : 4
    <1ad1>   DW_AT_type        : <0x1ad5>
 <1><1ad5>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <1ad6>   DW_AT_byte_size   : 4
    <1ad7>   DW_AT_type        : <0x1ac4>
 <1><1adb>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <1adc>   DW_AT_byte_size   : 4
    <1add>   DW_AT_type        : <0x19dd>
 <1><1ae1>: Abbrev Number: 3 (DW_TAG_typedef)
    <1ae2>   DW_AT_name        : (indirect string, offset: 0x34738): FILE
    <1ae6>   DW_AT_decl_file   : 9
    <1ae7>   DW_AT_decl_line   : 66
    <1ae8>   DW_AT_decl_column : 16
    <1ae9>   DW_AT_type        : <0x18e7>
 <1><1aed>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <1aee>   DW_AT_encoding    : 7	(unsigned)
    <1aef>   DW_AT_byte_size   : 1
    <1af0>   DW_AT_type        : <0x1128>
    <1af4>   DW_AT_decl_file   : 10
    <1af5>   DW_AT_decl_line   : 21
    <1af6>   DW_AT_decl_column : 1
    <1af7>   DW_AT_sibling     : <0x1b0e>
 <2><1afb>: Abbrev Number: 14 (DW_TAG_enumerator)
    <1afc>   DW_AT_name        : (indirect string, offset: 0x26103): GPIO_Speed_10MHz
    <1b00>   DW_AT_const_value : 1
 <2><1b01>: Abbrev Number: 14 (DW_TAG_enumerator)
    <1b02>   DW_AT_name        : (indirect string, offset: 0x1e585): GPIO_Speed_2MHz
    <1b06>   DW_AT_const_value : 2
 <2><1b07>: Abbrev Number: 14 (DW_TAG_enumerator)
    <1b08>   DW_AT_name        : (indirect string, offset: 0xf9b5): GPIO_Speed_50MHz
    <1b0c>   DW_AT_const_value : 3
 <2><1b0d>: Abbrev Number: 0
 <1><1b0e>: Abbrev Number: 3 (DW_TAG_typedef)
    <1b0f>   DW_AT_name        : (indirect string, offset: 0x32d05): GPIOSpeed_TypeDef
    <1b13>   DW_AT_decl_file   : 10
    <1b14>   DW_AT_decl_line   : 25
    <1b15>   DW_AT_decl_column : 2
    <1b16>   DW_AT_type        : <0x1aed>
 <1><1b1a>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <1b1b>   DW_AT_encoding    : 7	(unsigned)
    <1b1c>   DW_AT_byte_size   : 1
    <1b1d>   DW_AT_type        : <0x1128>
    <1b21>   DW_AT_decl_file   : 10
    <1b22>   DW_AT_decl_line   : 29
    <1b23>   DW_AT_decl_column : 1
    <1b24>   DW_AT_sibling     : <0x1b59>
 <2><1b28>: Abbrev Number: 14 (DW_TAG_enumerator)
    <1b29>   DW_AT_name        : (indirect string, offset: 0x344e3): GPIO_Mode_AIN
    <1b2d>   DW_AT_const_value : 0
 <2><1b2e>: Abbrev Number: 14 (DW_TAG_enumerator)
    <1b2f>   DW_AT_name        : (indirect string, offset: 0x1775c): GPIO_Mode_IN_FLOATING
    <1b33>   DW_AT_const_value : 4
 <2><1b34>: Abbrev Number: 14 (DW_TAG_enumerator)
    <1b35>   DW_AT_name        : (indirect string, offset: 0x8216): GPIO_Mode_IPD
    <1b39>   DW_AT_const_value : 40
 <2><1b3a>: Abbrev Number: 14 (DW_TAG_enumerator)
    <1b3b>   DW_AT_name        : (indirect string, offset: 0x827b): GPIO_Mode_IPU
    <1b3f>   DW_AT_const_value : 72
 <2><1b40>: Abbrev Number: 14 (DW_TAG_enumerator)
    <1b41>   DW_AT_name        : (indirect string, offset: 0x6a8d): GPIO_Mode_Out_OD
    <1b45>   DW_AT_const_value : 20
 <2><1b46>: Abbrev Number: 14 (DW_TAG_enumerator)
    <1b47>   DW_AT_name        : (indirect string, offset: 0x31db7): GPIO_Mode_Out_PP
    <1b4b>   DW_AT_const_value : 16
 <2><1b4c>: Abbrev Number: 14 (DW_TAG_enumerator)
    <1b4d>   DW_AT_name        : (indirect string, offset: 0xecd7): GPIO_Mode_AF_OD
    <1b51>   DW_AT_const_value : 28
 <2><1b52>: Abbrev Number: 14 (DW_TAG_enumerator)
    <1b53>   DW_AT_name        : (indirect string, offset: 0xf195): GPIO_Mode_AF_PP
    <1b57>   DW_AT_const_value : 24
 <2><1b58>: Abbrev Number: 0
 <1><1b59>: Abbrev Number: 3 (DW_TAG_typedef)
    <1b5a>   DW_AT_name        : (indirect string, offset: 0x1fc93): GPIOMode_TypeDef
    <1b5e>   DW_AT_decl_file   : 10
    <1b5f>   DW_AT_decl_line   : 37
    <1b60>   DW_AT_decl_column : 2
    <1b61>   DW_AT_type        : <0x1b1a>
 <1><1b65>: Abbrev Number: 21 (DW_TAG_structure_type)
    <1b66>   DW_AT_byte_size   : 4
    <1b67>   DW_AT_decl_file   : 10
    <1b68>   DW_AT_decl_line   : 40
    <1b69>   DW_AT_decl_column : 9
    <1b6a>   DW_AT_sibling     : <0x1b96>
 <2><1b6e>: Abbrev Number: 22 (DW_TAG_member)
    <1b6f>   DW_AT_name        : (indirect string, offset: 0x1069a): GPIO_Pin
    <1b73>   DW_AT_decl_file   : 10
    <1b74>   DW_AT_decl_line   : 42
    <1b75>   DW_AT_decl_column : 12
    <1b76>   DW_AT_type        : <0x118b>
    <1b7a>   DW_AT_data_member_location: 0
 <2><1b7b>: Abbrev Number: 22 (DW_TAG_member)
    <1b7c>   DW_AT_name        : (indirect string, offset: 0x8eb3): GPIO_Speed
    <1b80>   DW_AT_decl_file   : 10
    <1b81>   DW_AT_decl_line   : 45
    <1b82>   DW_AT_decl_column : 21
    <1b83>   DW_AT_type        : <0x1b0e>
    <1b87>   DW_AT_data_member_location: 2
 <2><1b88>: Abbrev Number: 22 (DW_TAG_member)
    <1b89>   DW_AT_name        : (indirect string, offset: 0x370a0): GPIO_Mode
    <1b8d>   DW_AT_decl_file   : 10
    <1b8e>   DW_AT_decl_line   : 48
    <1b8f>   DW_AT_decl_column : 20
    <1b90>   DW_AT_type        : <0x1b59>
    <1b94>   DW_AT_data_member_location: 3
 <2><1b95>: Abbrev Number: 0
 <1><1b96>: Abbrev Number: 3 (DW_TAG_typedef)
    <1b97>   DW_AT_name        : (indirect string, offset: 0x35ff6): GPIO_InitTypeDef
    <1b9b>   DW_AT_decl_file   : 10
    <1b9c>   DW_AT_decl_line   : 50
    <1b9d>   DW_AT_decl_column : 2
    <1b9e>   DW_AT_type        : <0x1b65>
 <1><1ba2>: Abbrev Number: 21 (DW_TAG_structure_type)
    <1ba3>   DW_AT_byte_size   : 16
    <1ba4>   DW_AT_decl_file   : 11
    <1ba5>   DW_AT_decl_line   : 20
    <1ba6>   DW_AT_decl_column : 9
    <1ba7>   DW_AT_sibling     : <0x1bfa>
 <2><1bab>: Abbrev Number: 22 (DW_TAG_member)
    <1bac>   DW_AT_name        : (indirect string, offset: 0x38c89): USART_BaudRate
    <1bb0>   DW_AT_decl_file   : 11
    <1bb1>   DW_AT_decl_line   : 22
    <1bb2>   DW_AT_decl_column : 12
    <1bb3>   DW_AT_type        : <0x119c>
    <1bb7>   DW_AT_data_member_location: 0
 <2><1bb8>: Abbrev Number: 22 (DW_TAG_member)
    <1bb9>   DW_AT_name        : (indirect string, offset: 0x38de7): USART_WordLength
    <1bbd>   DW_AT_decl_file   : 11
    <1bbe>   DW_AT_decl_line   : 27
    <1bbf>   DW_AT_decl_column : 12
    <1bc0>   DW_AT_type        : <0x118b>
    <1bc4>   DW_AT_data_member_location: 4
 <2><1bc5>: Abbrev Number: 22 (DW_TAG_member)
    <1bc6>   DW_AT_name        : (indirect string, offset: 0x38c39): USART_StopBits
    <1bca>   DW_AT_decl_file   : 11
    <1bcb>   DW_AT_decl_line   : 30
    <1bcc>   DW_AT_decl_column : 12
    <1bcd>   DW_AT_type        : <0x118b>
    <1bd1>   DW_AT_data_member_location: 6
 <2><1bd2>: Abbrev Number: 22 (DW_TAG_member)
    <1bd3>   DW_AT_name        : (indirect string, offset: 0x38ef7): USART_Parity
    <1bd7>   DW_AT_decl_file   : 11
    <1bd8>   DW_AT_decl_line   : 33
    <1bd9>   DW_AT_decl_column : 12
    <1bda>   DW_AT_type        : <0x118b>
    <1bde>   DW_AT_data_member_location: 8
 <2><1bdf>: Abbrev Number: 22 (DW_TAG_member)
    <1be0>   DW_AT_name        : (indirect string, offset: 0x38e6d): USART_Mode
    <1be4>   DW_AT_decl_file   : 11
    <1be5>   DW_AT_decl_line   : 40
    <1be6>   DW_AT_decl_column : 12
    <1be7>   DW_AT_type        : <0x118b>
    <1beb>   DW_AT_data_member_location: 10
 <2><1bec>: Abbrev Number: 22 (DW_TAG_member)
    <1bed>   DW_AT_name        : (indirect string, offset: 0x38f04): USART_HardwareFlowControl
    <1bf1>   DW_AT_decl_file   : 11
    <1bf2>   DW_AT_decl_line   : 43
    <1bf3>   DW_AT_decl_column : 12
    <1bf4>   DW_AT_type        : <0x118b>
    <1bf8>   DW_AT_data_member_location: 12
 <2><1bf9>: Abbrev Number: 0
 <1><1bfa>: Abbrev Number: 3 (DW_TAG_typedef)
    <1bfb>   DW_AT_name        : (indirect string, offset: 0x38cf6): USART_InitTypeDef
    <1bff>   DW_AT_decl_file   : 11
    <1c00>   DW_AT_decl_line   : 46
    <1c01>   DW_AT_decl_column : 3
    <1c02>   DW_AT_type        : <0x1ba2>
 <1><1c06>: Abbrev Number: 31 (DW_TAG_variable)
    <1c07>   DW_AT_name        : (indirect string, offset: 0x38e3d): __stdout
    <1c0b>   DW_AT_decl_file   : 12
    <1c0c>   DW_AT_decl_line   : 17
    <1c0d>   DW_AT_decl_column : 6
    <1c0e>   DW_AT_type        : <0x1ae1>
    <1c12>   DW_AT_external    : 1
 <1><1c12>: Abbrev Number: 32 (DW_TAG_variable)
    <1c13>   DW_AT_name        : (indirect string, offset: 0x38dd7): p_us
    <1c17>   DW_AT_decl_file   : 12
    <1c18>   DW_AT_decl_line   : 20
    <1c19>   DW_AT_decl_column : 12
    <1c1a>   DW_AT_type        : <0x1226>
 <1><1c1e>: Abbrev Number: 32 (DW_TAG_variable)
    <1c1f>   DW_AT_name        : (indirect string, offset: 0x38dab): p_ms
    <1c23>   DW_AT_decl_file   : 12
    <1c24>   DW_AT_decl_line   : 21
    <1c25>   DW_AT_decl_column : 12
    <1c26>   DW_AT_type        : <0x121a>
 <1><1c2a>: Abbrev Number: 33 (DW_TAG_subprogram)
    <1c2b>   DW_AT_external    : 1
    <1c2b>   DW_AT_name        : (indirect string, offset: 0x38ba6): USART_Printf_Init
    <1c2f>   DW_AT_decl_file   : 12
    <1c30>   DW_AT_decl_line   : 112
    <1c31>   DW_AT_decl_column : 6
    <1c32>   DW_AT_prototyped  : 1
    <1c32>   DW_AT_sibling     : <0x1c5b>
 <2><1c36>: Abbrev Number: 34 (DW_TAG_formal_parameter)
    <1c37>   DW_AT_name        : (indirect string, offset: 0x1bf8b): baudrate
    <1c3b>   DW_AT_decl_file   : 12
    <1c3c>   DW_AT_decl_line   : 112
    <1c3d>   DW_AT_decl_column : 28
    <1c3e>   DW_AT_type        : <0x120e>
 <2><1c42>: Abbrev Number: 32 (DW_TAG_variable)
    <1c43>   DW_AT_name        : (indirect string, offset: 0x30737): GPIO_InitStructure
    <1c47>   DW_AT_decl_file   : 12
    <1c48>   DW_AT_decl_line   : 114
    <1c49>   DW_AT_decl_column : 20
    <1c4a>   DW_AT_type        : <0x1b96>
 <2><1c4e>: Abbrev Number: 32 (DW_TAG_variable)
    <1c4f>   DW_AT_name        : (indirect string, offset: 0x38c48): USART_InitStructure
    <1c53>   DW_AT_decl_file   : 12
    <1c54>   DW_AT_decl_line   : 115
    <1c55>   DW_AT_decl_column : 21
    <1c56>   DW_AT_type        : <0x1bfa>
 <2><1c5a>: Abbrev Number: 0
 <1><1c5b>: Abbrev Number: 35 (DW_TAG_subprogram)
    <1c5c>   DW_AT_external    : 1
    <1c5c>   DW_AT_name        : (indirect string, offset: 0x38ad1): fputc
    <1c60>   DW_AT_decl_file   : 9
    <1c61>   DW_AT_decl_line   : 214
    <1c62>   DW_AT_decl_column : 5
    <1c63>   DW_AT_prototyped  : 1
    <1c63>   DW_AT_type        : <0x1171>
    <1c67>   DW_AT_sibling     : <0x1c82>
 <2><1c6b>: Abbrev Number: 34 (DW_TAG_formal_parameter)
    <1c6c>   DW_AT_name        : (indirect string, offset: 0x38b50): data
    <1c70>   DW_AT_decl_file   : 12
    <1c71>   DW_AT_decl_line   : 90
    <1c72>   DW_AT_decl_column : 15
    <1c73>   DW_AT_type        : <0x1171>
 <2><1c77>: Abbrev Number: 36 (DW_TAG_formal_parameter)
    <1c78>   DW_AT_name        : f
    <1c7a>   DW_AT_decl_file   : 12
    <1c7b>   DW_AT_decl_line   : 90
    <1c7c>   DW_AT_decl_column : 27
    <1c7d>   DW_AT_type        : <0x1c82>
 <2><1c81>: Abbrev Number: 0
 <1><1c82>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <1c83>   DW_AT_byte_size   : 4
    <1c84>   DW_AT_type        : <0x1ae1>
 <1><1c88>: Abbrev Number: 33 (DW_TAG_subprogram)
    <1c89>   DW_AT_external    : 1
    <1c89>   DW_AT_name        : (indirect string, offset: 0x38c72): Delay_Ms
    <1c8d>   DW_AT_decl_file   : 12
    <1c8e>   DW_AT_decl_line   : 67
    <1c8f>   DW_AT_decl_column : 6
    <1c90>   DW_AT_prototyped  : 1
    <1c90>   DW_AT_sibling     : <0x1ca9>
 <2><1c94>: Abbrev Number: 36 (DW_TAG_formal_parameter)
    <1c95>   DW_AT_name        : n
    <1c97>   DW_AT_decl_file   : 12
    <1c98>   DW_AT_decl_line   : 67
    <1c99>   DW_AT_decl_column : 19
    <1c9a>   DW_AT_type        : <0x121a>
 <2><1c9e>: Abbrev Number: 37 (DW_TAG_variable)
    <1c9f>   DW_AT_name        : i
    <1ca1>   DW_AT_decl_file   : 12
    <1ca2>   DW_AT_decl_line   : 69
    <1ca3>   DW_AT_decl_column : 6
    <1ca4>   DW_AT_type        : <0x120e>
 <2><1ca8>: Abbrev Number: 0
 <1><1ca9>: Abbrev Number: 33 (DW_TAG_subprogram)
    <1caa>   DW_AT_external    : 1
    <1caa>   DW_AT_name        : (indirect string, offset: 0x38e82): Delay_Us
    <1cae>   DW_AT_decl_file   : 12
    <1caf>   DW_AT_decl_line   : 43
    <1cb0>   DW_AT_decl_column : 6
    <1cb1>   DW_AT_prototyped  : 1
    <1cb1>   DW_AT_sibling     : <0x1cca>
 <2><1cb5>: Abbrev Number: 36 (DW_TAG_formal_parameter)
    <1cb6>   DW_AT_name        : n
    <1cb8>   DW_AT_decl_file   : 12
    <1cb9>   DW_AT_decl_line   : 43
    <1cba>   DW_AT_decl_column : 19
    <1cbb>   DW_AT_type        : <0x120e>
 <2><1cbf>: Abbrev Number: 37 (DW_TAG_variable)
    <1cc0>   DW_AT_name        : i
    <1cc2>   DW_AT_decl_file   : 12
    <1cc3>   DW_AT_decl_line   : 45
    <1cc4>   DW_AT_decl_column : 6
    <1cc5>   DW_AT_type        : <0x120e>
 <2><1cc9>: Abbrev Number: 0
 <1><1cca>: Abbrev Number: 38 (DW_TAG_subprogram)
    <1ccb>   DW_AT_external    : 1
    <1ccb>   DW_AT_name        : (indirect string, offset: 0x38b24): Delay_Init
    <1ccf>   DW_AT_decl_file   : 12
    <1cd0>   DW_AT_decl_line   : 29
    <1cd1>   DW_AT_decl_column : 6
    <1cd2>   DW_AT_prototyped  : 1
 <1><1cd2>: Abbrev Number: 0
  Compilation Unit @ offset 0x1cd3:
   Length:        0x444 (32-bit)
   Version:       4
   Abbrev Offset: 0x3b8
   Pointer Size:  4
 <0><1cde>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <1cdf>   DW_AT_producer    : (indirect string, offset: 0x3b6c): GNU C17 10.3.1 20210824 (release) -mthumb -mcpu=cortex-m3 -mfloat-abi=soft -march=armv7-m -g3 -flto -ffunction-sections -fdata-sections
    <1ce3>   DW_AT_language    : 12	(ANSI C99)
    <1ce4>   DW_AT_name        : (indirect string, offset: 0x39037): ../../driver/system_ch32f10x.c
    <1ce8>   DW_AT_comp_dir    : (indirect string, offset: 0x3aa0b): D:\work\gdk3\sdk\src\gem3
    <1cec>   DW_AT_stmt_list   : 0x1dce
    <1cf0>   DW_AT_GNU_macros  : 0xae77
 <1><1cf4>: Abbrev Number: 2 (DW_TAG_base_type)
    <1cf5>   DW_AT_byte_size   : 1
    <1cf6>   DW_AT_encoding    : 6	(signed char)
    <1cf7>   DW_AT_name        : (indirect string, offset: 0x2ab3c): signed char
 <1><1cfb>: Abbrev Number: 3 (DW_TAG_typedef)
    <1cfc>   DW_AT_name        : (indirect string, offset: 0x38aba): __uint8_t
    <1d00>   DW_AT_decl_file   : 1
    <1d01>   DW_AT_decl_line   : 43
    <1d02>   DW_AT_decl_column : 24
    <1d03>   DW_AT_type        : <0x1d07>
 <1><1d07>: Abbrev Number: 2 (DW_TAG_base_type)
    <1d08>   DW_AT_byte_size   : 1
    <1d09>   DW_AT_encoding    : 8	(unsigned char)
    <1d0a>   DW_AT_name        : (indirect string, offset: 0x293d5): unsigned char
 <1><1d0e>: Abbrev Number: 2 (DW_TAG_base_type)
    <1d0f>   DW_AT_byte_size   : 2
    <1d10>   DW_AT_encoding    : 5	(signed)
    <1d11>   DW_AT_name        : (indirect string, offset: 0x2229): short int
 <1><1d15>: Abbrev Number: 3 (DW_TAG_typedef)
    <1d16>   DW_AT_name        : (indirect string, offset: 0x2e280): __uint16_t
    <1d1a>   DW_AT_decl_file   : 1
    <1d1b>   DW_AT_decl_line   : 57
    <1d1c>   DW_AT_decl_column : 25
    <1d1d>   DW_AT_type        : <0x1d21>
 <1><1d21>: Abbrev Number: 2 (DW_TAG_base_type)
    <1d22>   DW_AT_byte_size   : 2
    <1d23>   DW_AT_encoding    : 7	(unsigned)
    <1d24>   DW_AT_name        : (indirect string, offset: 0x1d20e): short unsigned int
 <1><1d28>: Abbrev Number: 2 (DW_TAG_base_type)
    <1d29>   DW_AT_byte_size   : 4
    <1d2a>   DW_AT_encoding    : 5	(signed)
    <1d2b>   DW_AT_name        : (indirect string, offset: 0xb304): long int
 <1><1d2f>: Abbrev Number: 3 (DW_TAG_typedef)
    <1d30>   DW_AT_name        : (indirect string, offset: 0x19438): __uint32_t
    <1d34>   DW_AT_decl_file   : 1
    <1d35>   DW_AT_decl_line   : 79
    <1d36>   DW_AT_decl_column : 25
    <1d37>   DW_AT_type        : <0x1d3b>
 <1><1d3b>: Abbrev Number: 2 (DW_TAG_base_type)
    <1d3c>   DW_AT_byte_size   : 4
    <1d3d>   DW_AT_encoding    : 7	(unsigned)
    <1d3e>   DW_AT_name        : (indirect string, offset: 0x21fc8): long unsigned int
 <1><1d42>: Abbrev Number: 2 (DW_TAG_base_type)
    <1d43>   DW_AT_byte_size   : 8
    <1d44>   DW_AT_encoding    : 5	(signed)
    <1d45>   DW_AT_name        : (indirect string, offset: 0x16e38): long long int
 <1><1d49>: Abbrev Number: 2 (DW_TAG_base_type)
    <1d4a>   DW_AT_byte_size   : 8
    <1d4b>   DW_AT_encoding    : 7	(unsigned)
    <1d4c>   DW_AT_name        : (indirect string, offset: 0x13329): long long unsigned int
 <1><1d50>: Abbrev Number: 4 (DW_TAG_base_type)
    <1d51>   DW_AT_byte_size   : 4
    <1d52>   DW_AT_encoding    : 5	(signed)
    <1d53>   DW_AT_name        : int
 <1><1d57>: Abbrev Number: 2 (DW_TAG_base_type)
    <1d58>   DW_AT_byte_size   : 4
    <1d59>   DW_AT_encoding    : 7	(unsigned)
    <1d5a>   DW_AT_name        : (indirect string, offset: 0x32f20): unsigned int
 <1><1d5e>: Abbrev Number: 3 (DW_TAG_typedef)
    <1d5f>   DW_AT_name        : (indirect string, offset: 0x38abc): uint8_t
    <1d63>   DW_AT_decl_file   : 2
    <1d64>   DW_AT_decl_line   : 24
    <1d65>   DW_AT_decl_column : 19
    <1d66>   DW_AT_type        : <0x1cfb>
 <1><1d6a>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <1d6b>   DW_AT_type        : <0x1d5e>
 <1><1d6f>: Abbrev Number: 6 (DW_TAG_const_type)
    <1d70>   DW_AT_type        : <0x1d6a>
 <1><1d74>: Abbrev Number: 3 (DW_TAG_typedef)
    <1d75>   DW_AT_name        : (indirect string, offset: 0x2e282): uint16_t
    <1d79>   DW_AT_decl_file   : 2
    <1d7a>   DW_AT_decl_line   : 36
    <1d7b>   DW_AT_decl_column : 20
    <1d7c>   DW_AT_type        : <0x1d15>
 <1><1d80>: Abbrev Number: 3 (DW_TAG_typedef)
    <1d81>   DW_AT_name        : (indirect string, offset: 0x1943a): uint32_t
    <1d85>   DW_AT_decl_file   : 2
    <1d86>   DW_AT_decl_line   : 48
    <1d87>   DW_AT_decl_column : 20
    <1d88>   DW_AT_type        : <0x1d2f>
 <1><1d8c>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <1d8d>   DW_AT_type        : <0x1d80>
 <1><1d91>: Abbrev Number: 6 (DW_TAG_const_type)
    <1d92>   DW_AT_type        : <0x1d8c>
 <1><1d96>: Abbrev Number: 7 (DW_TAG_structure_type)
    <1d97>   DW_AT_byte_size   : 116
    <1d98>   DW_AT_decl_file   : 3
    <1d99>   DW_AT_decl_line   : 155
    <1d9a>   DW_AT_decl_column : 9
    <1d9b>   DW_AT_sibling     : <0x1e97>
 <2><1d9f>: Abbrev Number: 8 (DW_TAG_member)
    <1da0>   DW_AT_name        : (indirect string, offset: 0x38ff6): CPUID
    <1da4>   DW_AT_decl_file   : 3
    <1da5>   DW_AT_decl_line   : 157
    <1da6>   DW_AT_decl_column : 17
    <1da7>   DW_AT_type        : <0x1d91>
    <1dab>   DW_AT_data_member_location: 0
 <2><1dac>: Abbrev Number: 8 (DW_TAG_member)
    <1dad>   DW_AT_name        : (indirect string, offset: 0x3905c): ICSR
    <1db1>   DW_AT_decl_file   : 3
    <1db2>   DW_AT_decl_line   : 158
    <1db3>   DW_AT_decl_column : 17
    <1db4>   DW_AT_type        : <0x1d8c>
    <1db8>   DW_AT_data_member_location: 4
 <2><1db9>: Abbrev Number: 8 (DW_TAG_member)
    <1dba>   DW_AT_name        : (indirect string, offset: 0x38fbf): VTOR
    <1dbe>   DW_AT_decl_file   : 3
    <1dbf>   DW_AT_decl_line   : 159
    <1dc0>   DW_AT_decl_column : 17
    <1dc1>   DW_AT_type        : <0x1d8c>
    <1dc5>   DW_AT_data_member_location: 8
 <2><1dc6>: Abbrev Number: 8 (DW_TAG_member)
    <1dc7>   DW_AT_name        : (indirect string, offset: 0x3909a): AIRCR
    <1dcb>   DW_AT_decl_file   : 3
    <1dcc>   DW_AT_decl_line   : 160
    <1dcd>   DW_AT_decl_column : 17
    <1dce>   DW_AT_type        : <0x1d8c>
    <1dd2>   DW_AT_data_member_location: 12
 <2><1dd3>: Abbrev Number: 9 (DW_TAG_member)
    <1dd4>   DW_AT_name        : SCR
    <1dd8>   DW_AT_decl_file   : 3
    <1dd9>   DW_AT_decl_line   : 161
    <1dda>   DW_AT_decl_column : 17
    <1ddb>   DW_AT_type        : <0x1d8c>
    <1ddf>   DW_AT_data_member_location: 16
 <2><1de0>: Abbrev Number: 9 (DW_TAG_member)
    <1de1>   DW_AT_name        : CCR
    <1de5>   DW_AT_decl_file   : 3
    <1de6>   DW_AT_decl_line   : 162
    <1de7>   DW_AT_decl_column : 17
    <1de8>   DW_AT_type        : <0x1d8c>
    <1dec>   DW_AT_data_member_location: 20
 <2><1ded>: Abbrev Number: 9 (DW_TAG_member)
    <1dee>   DW_AT_name        : SHP
    <1df2>   DW_AT_decl_file   : 3
    <1df3>   DW_AT_decl_line   : 163
    <1df4>   DW_AT_decl_column : 17
    <1df5>   DW_AT_type        : <0x1ea7>
    <1df9>   DW_AT_data_member_location: 24
 <2><1dfa>: Abbrev Number: 8 (DW_TAG_member)
    <1dfb>   DW_AT_name        : (indirect string, offset: 0x390a0): SHCSR
    <1dff>   DW_AT_decl_file   : 3
    <1e00>   DW_AT_decl_line   : 164
    <1e01>   DW_AT_decl_column : 17
    <1e02>   DW_AT_type        : <0x1d8c>
    <1e06>   DW_AT_data_member_location: 36
 <2><1e07>: Abbrev Number: 8 (DW_TAG_member)
    <1e08>   DW_AT_name        : (indirect string, offset: 0x39015): CFSR
    <1e0c>   DW_AT_decl_file   : 3
    <1e0d>   DW_AT_decl_line   : 165
    <1e0e>   DW_AT_decl_column : 17
    <1e0f>   DW_AT_type        : <0x1d8c>
    <1e13>   DW_AT_data_member_location: 40
 <2><1e14>: Abbrev Number: 8 (DW_TAG_member)
    <1e15>   DW_AT_name        : (indirect string, offset: 0x3901a): HFSR
    <1e19>   DW_AT_decl_file   : 3
    <1e1a>   DW_AT_decl_line   : 166
    <1e1b>   DW_AT_decl_column : 17
    <1e1c>   DW_AT_type        : <0x1d8c>
    <1e20>   DW_AT_data_member_location: 44
 <2><1e21>: Abbrev Number: 8 (DW_TAG_member)
    <1e22>   DW_AT_name        : (indirect string, offset: 0x39061): DFSR
    <1e26>   DW_AT_decl_file   : 3
    <1e27>   DW_AT_decl_line   : 167
    <1e28>   DW_AT_decl_column : 17
    <1e29>   DW_AT_type        : <0x1d8c>
    <1e2d>   DW_AT_data_member_location: 48
 <2><1e2e>: Abbrev Number: 8 (DW_TAG_member)
    <1e2f>   DW_AT_name        : (indirect string, offset: 0x39028): MMFAR
    <1e33>   DW_AT_decl_file   : 3
    <1e34>   DW_AT_decl_line   : 168
    <1e35>   DW_AT_decl_column : 17
    <1e36>   DW_AT_type        : <0x1d8c>
    <1e3a>   DW_AT_data_member_location: 52
 <2><1e3b>: Abbrev Number: 8 (DW_TAG_member)
    <1e3c>   DW_AT_name        : (indirect string, offset: 0x38f72): BFAR
    <1e40>   DW_AT_decl_file   : 3
    <1e41>   DW_AT_decl_line   : 169
    <1e42>   DW_AT_decl_column : 17
    <1e43>   DW_AT_type        : <0x1d8c>
    <1e47>   DW_AT_data_member_location: 56
 <2><1e48>: Abbrev Number: 8 (DW_TAG_member)
    <1e49>   DW_AT_name        : (indirect string, offset: 0x39086): AFSR
    <1e4d>   DW_AT_decl_file   : 3
    <1e4e>   DW_AT_decl_line   : 170
    <1e4f>   DW_AT_decl_column : 17
    <1e50>   DW_AT_type        : <0x1d8c>
    <1e54>   DW_AT_data_member_location: 60
 <2><1e55>: Abbrev Number: 9 (DW_TAG_member)
    <1e56>   DW_AT_name        : PFR
    <1e5a>   DW_AT_decl_file   : 3
    <1e5b>   DW_AT_decl_line   : 171
    <1e5c>   DW_AT_decl_column : 17
    <1e5d>   DW_AT_type        : <0x1ec1>
    <1e61>   DW_AT_data_member_location: 64
 <2><1e62>: Abbrev Number: 9 (DW_TAG_member)
    <1e63>   DW_AT_name        : DFR
    <1e67>   DW_AT_decl_file   : 3
    <1e68>   DW_AT_decl_line   : 172
    <1e69>   DW_AT_decl_column : 17
    <1e6a>   DW_AT_type        : <0x1d91>
    <1e6e>   DW_AT_data_member_location: 72
 <2><1e6f>: Abbrev Number: 9 (DW_TAG_member)
    <1e70>   DW_AT_name        : ADR
    <1e74>   DW_AT_decl_file   : 3
    <1e75>   DW_AT_decl_line   : 173
    <1e76>   DW_AT_decl_column : 17
    <1e77>   DW_AT_type        : <0x1d91>
    <1e7b>   DW_AT_data_member_location: 76
 <2><1e7c>: Abbrev Number: 8 (DW_TAG_member)
    <1e7d>   DW_AT_name        : (indirect string, offset: 0x390a6): MMFR
    <1e81>   DW_AT_decl_file   : 3
    <1e82>   DW_AT_decl_line   : 174
    <1e83>   DW_AT_decl_column : 17
